[Killed] StringLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:18:20
   id: z.string().uuid(),
   artifact: z.string(),
   fromLayer: z.enum(['bronze', 'silver']),
-  toLayer: z.enum(['silver', 'gold']),
+  toLayer: z.enum(["", 'gold']),
   mutationScore: z.number().min(80).max(98.99),
   timestamp: z.string().datetime(),
killedBy: Property 17: Receipt Hash Integrity Receipt Creation receipt validates against schema
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:19:18
   artifact: z.string(),
   fromLayer: z.enum(['bronze', 'silver']),
   toLayer: z.enum(['silver', 'gold']),
-  mutationScore: z.number().min(80).max(98.99),
+  mutationScore: z.number().min(80).min(98.99),
   timestamp: z.string().datetime(),
   hash: z.string().regex(/^sha256:[a-f0-9]{64}$/),
killedBy: Property 17: Receipt Hash Integrity Receipt Creation receipt validates against schema
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:19:18
   artifact: z.string(),
   fromLayer: z.enum(['bronze', 'silver']),
   toLayer: z.enum(['silver', 'gold']),
-  mutationScore: z.number().min(80).max(98.99),
+  mutationScore: z.number().max(80).max(98.99),
   timestamp: z.string().datetime(),
   hash: z.string().regex(/^sha256:[a-f0-9]{64}$/),
killedBy: Property 17: Receipt Hash Integrity Receipt Creation receipt validates against schema
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:34:69
 /**
  * Computes SHA-256 hash of content (browser/Node compatible)
  */
-export async function computeHash(content: string): Promise<string> {
-  const encoder = new TextEncoder();
-  const data = encoder.encode(content);
-  const hashBuffer = await crypto.subtle.digest('SHA-256', data);
-  const hashArray = Array.from(new Uint8Array(hashBuffer));
-  const hashHex = hashArray.map(b => b.toString(16).padStart(2, '0')).join('');
-  return `sha256:${hashHex}`;
-}
+export async function computeHash(content: string): Promise<string> {}
 
 /**

[NoCoverage] StringLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:37:49
 export async function computeHash(content: string): Promise<string> {
   const encoder = new TextEncoder();
   const data = encoder.encode(content);
-  const hashBuffer = await crypto.subtle.digest('SHA-256', data);
+  const hashBuffer = await crypto.subtle.digest("", data);
   const hashArray = Array.from(new Uint8Array(hashBuffer));
   const hashHex = hashArray.map(b => b.toString(16).padStart(2, '0')).join('');

[NoCoverage] ArrowFunction
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:39:33
   const data = encoder.encode(content);
   const hashBuffer = await crypto.subtle.digest('SHA-256', data);
   const hashArray = Array.from(new Uint8Array(hashBuffer));
-  const hashHex = hashArray.map(b => b.toString(16).padStart(2, '0')).join('');
+  const hashHex = hashArray.map(() => undefined).join('');
   return `sha256:${hashHex}`;
 }

[NoCoverage] StringLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:39:65
   const data = encoder.encode(content);
   const hashBuffer = await crypto.subtle.digest('SHA-256', data);
   const hashArray = Array.from(new Uint8Array(hashBuffer));
-  const hashHex = hashArray.map(b => b.toString(16).padStart(2, '0')).join('');
+  const hashHex = hashArray.map(b => b.toString(16).padStart(2, "")).join('');
   return `sha256:${hashHex}`;
 }

[NoCoverage] StringLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:40:10
   const hashBuffer = await crypto.subtle.digest('SHA-256', data);
   const hashArray = Array.from(new Uint8Array(hashBuffer));
   const hashHex = hashArray.map(b => b.toString(16).padStart(2, '0')).join('');
-  return `sha256:${hashHex}`;
+  return ``;
 }
 

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:47:58
  * Computes hash synchronously using simple algorithm (for testing)
  * Note: In production, use computeHash for proper SHA-256
  */
-export function computeHashSync(content: string): string {
-  // Simple hash for testing - NOT cryptographically secure
-  let hash = 0;
-  for (let i = 0; i < content.length; i++) {
-    const char = content.charCodeAt(i);
-    hash = ((hash << 5) - hash) + char;
-    hash = hash & hash;
-  }
-  const hex = Math.abs(hash).toString(16).padStart(64, '0').slice(0, 64);
-  return `sha256:${hex}`;
-}
+export function computeHashSync(content: string): string {}
 
 /**
killedBy: Property 17: Receipt Hash Integrity Hash Computation different content produces different hash; Property 17: Receipt Hash Integrity Hash Computation hash has correct format; Property 17: Receipt Hash Integrity Receipt Creation creates valid receipt with hash
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:50:19
 export function computeHashSync(content: string): string {
   // Simple hash for testing - NOT cryptographically secure
   let hash = 0;
-  for (let i = 0; i < content.length; i++) {
+  for (let i = 0; i <= content.length; i++) {
     const char = content.charCodeAt(i);
     hash = ((hash << 5) - hash) + char;
killedBy: Property 17: Receipt Hash Integrity Hash Computation different content produces different hash; Property 17: Receipt Hash Integrity Hash Verification tampered receipt fails verification; Property 17: Receipt Hash Integrity Hash Verification tampered artifact fails verification
statusReason: expected 'sha256:000000000000000000000000000000…' not to be 'sha256:000000000000000000000000000000…' // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:50:19
 export function computeHashSync(content: string): string {
   // Simple hash for testing - NOT cryptographically secure
   let hash = 0;
-  for (let i = 0; i < content.length; i++) {
+  for (let i = 0; false; i++) {
     const char = content.charCodeAt(i);
     hash = ((hash << 5) - hash) + char;
killedBy: Property 17: Receipt Hash Integrity Hash Computation different content produces different hash; Property 17: Receipt Hash Integrity Hash Verification tampered receipt fails verification; Property 17: Receipt Hash Integrity Hash Verification tampered artifact fails verification
statusReason: expected 'sha256:000000000000000000000000000000…' not to be 'sha256:000000000000000000000000000000…' // Object.is equality

[Survived] ArithmeticOperator
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:52:12
   let hash = 0;
   for (let i = 0; i < content.length; i++) {
     const char = content.charCodeAt(i);
-    hash = ((hash << 5) - hash) + char;
+    hash = (hash << 5) - hash - char;
     hash = hash & hash;
   }

[Survived] ArithmeticOperator
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:52:13
   let hash = 0;
   for (let i = 0; i < content.length; i++) {
     const char = content.charCodeAt(i);
-    hash = ((hash << 5) - hash) + char;
+    hash = ((hash << 5) + hash) + char;
     hash = hash & hash;
   }

[Survived] MethodExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:55:15
     hash = ((hash << 5) - hash) + char;
     hash = hash & hash;
   }
-  const hex = Math.abs(hash).toString(16).padStart(64, '0').slice(0, 64);
+  const hex = Math.abs(hash).toString(16).padStart(64, '0');
   return `sha256:${hex}`;
 }

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:62:87
 /**
  * Creates receipt content string for hashing (excludes hash field)
  */
-export function createReceiptContent(receipt: Omit<PromotionReceipt, 'hash'>): string {
-  return JSON.stringify({
-    id: receipt.id,
-    artifact: receipt.artifact,
-    fromLayer: receipt.fromLayer,
-    toLayer: receipt.toLayer,
-    mutationScore: receipt.mutationScore,
-    timestamp: receipt.timestamp,
-    propertyTestsPassed: receipt.propertyTestsPassed,
-    zodContractsPresent: receipt.zodContractsPresent,
-    provenanceHeadersPresent: receipt.provenanceHeadersPresent,
-  });
-}
+export function createReceiptContent(receipt: Omit<PromotionReceipt, 'hash'>): string {}
 
 /**
killedBy: Property 17: Receipt Hash Integrity Receipt Creation creates valid receipt with hash; Property 17: Receipt Hash Integrity Receipt Creation receipt validates against schema; Property 17: Receipt Hash Integrity Receipt Creation receipt has valid UUID
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:79:71
 /**
  * Verifies receipt hash integrity
  */
-export function verifyReceiptHash(receipt: PromotionReceipt): boolean {
-  const { hash, ...rest } = receipt;
-  const content = createReceiptContent(rest);
-  const expectedHash = computeHashSync(content);
-  return hash === expectedHash;
-}
+export function verifyReceiptHash(receipt: PromotionReceipt): boolean {}
 
 /**
killedBy: Property 17: Receipt Hash Integrity Hash Verification valid receipt passes verification; Property 17: Receipt Hash Integrity Hash Verification tampered receipt fails verification; Property 17: Receipt Hash Integrity Hash Verification tampered artifact fails verification
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:83:10
   const { hash, ...rest } = receipt;
   const content = createReceiptContent(rest);
   const expectedHash = computeHashSync(content);
-  return hash === expectedHash;
+  return false;
 }
 
killedBy: Property 17: Receipt Hash Integrity Hash Verification valid receipt passes verification; Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:83:10
   const { hash, ...rest } = receipt;
   const content = createReceiptContent(rest);
   const expectedHash = computeHashSync(content);
-  return hash === expectedHash;
+  return true;
 }
 
killedBy: Property 17: Receipt Hash Integrity Hash Verification tampered receipt fails verification; Property 17: Receipt Hash Integrity Hash Verification tampered artifact fails verification
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:99:21
     zodContractsPresent: boolean;
     provenanceHeadersPresent: boolean;
   }
-): PromotionReceipt {
-  const receiptWithoutHash = {
-    id: crypto.randomUUID(),
-    artifact,
-    fromLayer,
-    toLayer,
-    mutationScore,
-    timestamp: new Date().toISOString(),
-    ...options,
-  };
-  
-  const content = createReceiptContent(receiptWithoutHash);
-  const hash = computeHashSync(content);
-  
-  return {
-    ...receiptWithoutHash,
-    hash,
-  };
-}
+): PromotionReceipt {}
 
 /**
killedBy: Property 17: Receipt Hash Integrity Receipt Creation creates valid receipt with hash; Property 17: Receipt Hash Integrity Receipt Creation receipt validates against schema; Property 17: Receipt Hash Integrity Receipt Creation receipt has valid UUID
statusReason: Cannot read properties of undefined (reading 'hash')

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:122:105
 /**
  * Validates receipt meets Silver Standard requirements
  */
-export function validateSilverStandard(receipt: PromotionReceipt): { valid: boolean; errors: string[] } {
-  const errors: string[] = [];
-  
-  if (receipt.mutationScore < 80) {
-    errors.push(`Mutation score ${receipt.mutationScore}% below minimum 80%`);
-  }
-  if (receipt.mutationScore > 98.99) {
-    errors.push(`Mutation score ${receipt.mutationScore}% above maximum 98.99% (Theater detected)`);
-  }
-  if (!receipt.propertyTestsPassed) {
-    errors.push('Property tests not passed');
-  }
-  if (!receipt.zodContractsPresent) {
-    errors.push('Zod contracts not present');
-  }
-  if (!receipt.provenanceHeadersPresent) {
-    errors.push('Provenance headers not present');
-  }
-  if (!verifyReceiptHash(receipt)) {
-    errors.push('Receipt hash integrity check failed');
-  }
-  
-  return { valid: errors.length === 0, errors };
-}
+export function validateSilverStandard(receipt: PromotionReceipt): { valid: boolean; errors: string[] } {}
 
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard; Property 17: Receipt Hash Integrity Silver Standard Validation low mutation score fails; Property 17: Receipt Hash Integrity Silver Standard Validation theater score (>98.99%) fails
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:125:35
 export function validateSilverStandard(receipt: PromotionReceipt): { valid: boolean; errors: string[] } {
   const errors: string[] = [];
   
-  if (receipt.mutationScore < 80) {
-    errors.push(`Mutation score ${receipt.mutationScore}% below minimum 80%`);
-  }
+  if (receipt.mutationScore < 80) {}
   if (receipt.mutationScore > 98.99) {
     errors.push(`Mutation score ${receipt.mutationScore}% above maximum 98.99% (Theater detected)`);
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation low mutation score fails
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:125:7
 export function validateSilverStandard(receipt: PromotionReceipt): { valid: boolean; errors: string[] } {
   const errors: string[] = [];
   
-  if (receipt.mutationScore < 80) {
+  if (true) {
     errors.push(`Mutation score ${receipt.mutationScore}% below minimum 80%`);
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:128:7
   if (receipt.mutationScore < 80) {
     errors.push(`Mutation score ${receipt.mutationScore}% below minimum 80%`);
   }
-  if (receipt.mutationScore > 98.99) {
+  if (receipt.mutationScore <= 98.99) {
     errors.push(`Mutation score ${receipt.mutationScore}% above maximum 98.99% (Theater detected)`);
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard; Property 17: Receipt Hash Integrity Silver Standard Validation theater score (>98.99%) fails
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:128:38
   if (receipt.mutationScore < 80) {
     errors.push(`Mutation score ${receipt.mutationScore}% below minimum 80%`);
   }
-  if (receipt.mutationScore > 98.99) {
-    errors.push(`Mutation score ${receipt.mutationScore}% above maximum 98.99% (Theater detected)`);
-  }
+  if (receipt.mutationScore > 98.99) {}
   if (!receipt.propertyTestsPassed) {
     errors.push('Property tests not passed');
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation theater score (>98.99%) fails
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:131:37
   if (receipt.mutationScore > 98.99) {
     errors.push(`Mutation score ${receipt.mutationScore}% above maximum 98.99% (Theater detected)`);
   }
-  if (!receipt.propertyTestsPassed) {
-    errors.push('Property tests not passed');
-  }
+  if (!receipt.propertyTestsPassed) {}
   if (!receipt.zodContractsPresent) {
     errors.push('Zod contracts not present');
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation missing property tests fails
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:131:7
   if (receipt.mutationScore > 98.99) {
     errors.push(`Mutation score ${receipt.mutationScore}% above maximum 98.99% (Theater detected)`);
   }
-  if (!receipt.propertyTestsPassed) {
+  if (false) {
     errors.push('Property tests not passed');
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation missing property tests fails
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:134:7
   if (!receipt.propertyTestsPassed) {
     errors.push('Property tests not passed');
   }
-  if (!receipt.zodContractsPresent) {
+  if (false) {
     errors.push('Zod contracts not present');
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation missing Zod contracts fails
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:134:37
   if (!receipt.propertyTestsPassed) {
     errors.push('Property tests not passed');
   }
-  if (!receipt.zodContractsPresent) {
-    errors.push('Zod contracts not present');
-  }
+  if (!receipt.zodContractsPresent) {}
   if (!receipt.provenanceHeadersPresent) {
     errors.push('Provenance headers not present');
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation missing Zod contracts fails
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:135:17
     errors.push('Property tests not passed');
   }
   if (!receipt.zodContractsPresent) {
-    errors.push('Zod contracts not present');
+    errors.push("");
   }
   if (!receipt.provenanceHeadersPresent) {
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation missing Zod contracts fails
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:137:7
   if (!receipt.zodContractsPresent) {
     errors.push('Zod contracts not present');
   }
-  if (!receipt.provenanceHeadersPresent) {
+  if (receipt.provenanceHeadersPresent) {
     errors.push('Provenance headers not present');
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard; Property 17: Receipt Hash Integrity Silver Standard Validation missing provenance headers fails
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:137:42
   if (!receipt.zodContractsPresent) {
     errors.push('Zod contracts not present');
   }
-  if (!receipt.provenanceHeadersPresent) {
-    errors.push('Provenance headers not present');
-  }
+  if (!receipt.provenanceHeadersPresent) {}
   if (!verifyReceiptHash(receipt)) {
     errors.push('Receipt hash integrity check failed');
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation missing provenance headers fails
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:140:7
   if (!receipt.provenanceHeadersPresent) {
     errors.push('Provenance headers not present');
   }
-  if (!verifyReceiptHash(receipt)) {
+  if (true) {
     errors.push('Receipt hash integrity check failed');
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
hot_obsidian_sandbox/bronze/contracts/receipt-hash.ts:140:7
   if (!receipt.provenanceHeadersPresent) {
     errors.push('Provenance headers not present');
   }
-  if (!verifyReceiptHash(receipt)) {
+  if (verifyReceiptHash(receipt)) {
     errors.push('Receipt hash integrity check failed');
   }
killedBy: Property 17: Receipt Hash Integrity Silver Standard Validation valid receipt passes Silver Standard
statusReason: expected false to be true // Object.is equality
