[Killed] ArrayDeclaration
bronze/P0_LIDLESS_LEGION/contracts/index.ts:15:47
 
 // --- OBSERVATION SOURCE ---
 
-export const ObservationSourceSchema = z.enum([
-  'TAVILY',      // Web search
-  'PERPLEXITY',  // AI search
-  'OSINT',       // Open source intelligence
-  'MEDIAPIPE',   // Gesture recognition
-  'WEBCAM',      // Raw video input
-  'FILE_SYSTEM', // Local file observation
-  'STIGMERGY',   // Blackboard observation
-]);
+export const ObservationSourceSchema = z.enum([]);
 
 export type ObservationSource = z.infer<typeof ObservationSourceSchema>;
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observations validate against schema; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema; P0 LIDLESS LEGION - Property Tests Observation Filtering filter schema validates
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:16:3
 // --- OBSERVATION SOURCE ---
 
 export const ObservationSourceSchema = z.enum([
-  'TAVILY',      // Web search
+  "",      // Web search
   'PERPLEXITY',  // AI search
   'OSINT',       // Open source intelligence
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema; P0 LIDLESS LEGION - Property Tests Observation Filtering filter schema validates
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:18:3
 export const ObservationSourceSchema = z.enum([
   'TAVILY',      // Web search
   'PERPLEXITY',  // AI search
-  'OSINT',       // Open source intelligence
+  "",       // Open source intelligence
   'MEDIAPIPE',   // Gesture recognition
   'WEBCAM',      // Raw video input
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:21:3
   'OSINT',       // Open source intelligence
   'MEDIAPIPE',   // Gesture recognition
   'WEBCAM',      // Raw video input
-  'FILE_SYSTEM', // Local file observation
+  "", // Local file observation
   'STIGMERGY',   // Blackboard observation
 ]);

[Survived] StringLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:22:3
   'MEDIAPIPE',   // Gesture recognition
   'WEBCAM',      // Raw video input
   'FILE_SYSTEM', // Local file observation
-  'STIGMERGY',   // Blackboard observation
+  "",   // Blackboard observation
 ]);
 

[Killed] ObjectLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:29:43
 
 // --- OBSERVATION SCHEMA ---
 
-export const ObservationSchema = z.object({
-  id: z.string().uuid(),
-  timestamp: z.number(),
-  source: ObservationSourceSchema,
-  query: z.string().optional(),
-  data: z.unknown(),
-  confidence: z.number().min(0).max(1).default(1),
-  metadata: z.object({
-    latencyMs: z.number().min(0).optional(),
-    sourceUrl: z.string().url().optional(),
-    tags: z.array(z.string()).default([]),
-  }),
-});
+export const ObservationSchema = z.object({});
 
 export type Observation = z.infer<typeof ObservationSchema>;
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant confidence is bounded [0, 1]
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:35:15
   source: ObservationSourceSchema,
   query: z.string().optional(),
   data: z.unknown(),
-  confidence: z.number().min(0).max(1).default(1),
+  confidence: z.number().max(0).max(1).default(1),
   metadata: z.object({
     latencyMs: z.number().min(0).optional(),
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observations validate against schema; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:35:15
   source: ObservationSourceSchema,
   query: z.string().optional(),
   data: z.unknown(),
-  confidence: z.number().min(0).max(1).default(1),
+  confidence: z.number().min(0).min(1).default(1),
   metadata: z.object({
     latencyMs: z.number().min(0).optional(),
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observations validate against schema; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant confidence is bounded [0, 1]
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:37:16
   data: z.unknown(),
   confidence: z.number().min(0).max(1).default(1),
   metadata: z.object({
-    latencyMs: z.number().min(0).optional(),
+    latencyMs: z.number().max(0).optional(),
     sourceUrl: z.string().url().optional(),
     tags: z.array(z.string()).default([]),
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observations validate against schema
statusReason: expected false to be true // Object.is equality

[Survived] BooleanLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:62:34
   success: z.boolean(),
   observation: ObservationSchema.optional(),
   error: z.string().optional(),
-  retryable: z.boolean().default(false),
+  retryable: z.boolean().default(true),
 });
 

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:71:18
 
 export const ObservationFilterSchema = z.object({
   sources: z.array(ObservationSourceSchema).optional(),
-  minConfidence: z.number().min(0).max(1).optional(),
+  minConfidence: z.number().max(0).max(1).optional(),
   tags: z.array(z.string()).optional(),
   since: z.number().optional(),
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filter schema validates
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:71:18
 
 export const ObservationFilterSchema = z.object({
   sources: z.array(ObservationSourceSchema).optional(),
-  minConfidence: z.number().min(0).max(1).optional(),
+  minConfidence: z.number().min(0).min(1).optional(),
   tags: z.array(z.string()).optional(),
   since: z.number().optional(),
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filter schema validates
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:74:10
   minConfidence: z.number().min(0).max(1).optional(),
   tags: z.array(z.string()).optional(),
   since: z.number().optional(),
-  limit: z.number().int().min(1).max(1000).default(100),
+  limit: z.number().int().max(1).max(1000).default(100),
 });
 
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filter schema validates
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:74:10
   minConfidence: z.number().min(0).max(1).optional(),
   tags: z.array(z.string()).optional(),
   since: z.number().optional(),
-  limit: z.number().int().min(1).max(1000).default(100),
+  limit: z.number().int().min(1).min(1000).default(100),
 });
 
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filter schema validates
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
bronze/P0_LIDLESS_LEGION/contracts/index.ts:87:54
 /**
  * Validates that P0 only uses allowed verbs (separation of concerns)
  */
-export function isAllowedVerb(verb: string): boolean {
-  return (ALLOWED_VERBS as readonly string[]).includes(verb);
-}
+export function isAllowedVerb(verb: string): boolean {}
 
 /**
killedBy: P0 LIDLESS LEGION - Property Tests Property 3: Separation of Concerns OBSERVE is an allowed verb; P0 LIDLESS LEGION - Property Tests Property 3: Separation of Concerns SENSE is an allowed verb; P0 LIDLESS LEGION - Property Tests Property 3: Separation of Concerns SHAPE is forbidden for P0
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
bronze/P0_LIDLESS_LEGION/contracts/index.ts:94:56
 /**
  * Checks if a verb is forbidden for P0
  */
-export function isForbiddenVerb(verb: string): boolean {
-  return (FORBIDDEN_VERBS as readonly string[]).includes(verb);
-}
+export function isForbiddenVerb(verb: string): boolean {}
 
 // --- OBSERVATION FUNCTIONS ---
killedBy: P0 LIDLESS LEGION - Property Tests Property 3: Separation of Concerns SHAPE is forbidden for P0; P0 LIDLESS LEGION - Property Tests Property 3: Separation of Concerns STORE is forbidden for P0; P0 LIDLESS LEGION - Property Tests Property 3: Separation of Concerns DECIDE is forbidden for P0
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
bronze/P0_LIDLESS_LEGION/contracts/index.ts:113:16
     sourceUrl?: string;
     tags?: string[];
   }
-): Observation {
-  return {
-    id: crypto.randomUUID(),
-    timestamp: Date.now(),
-    source,
-    query: options?.query,
-    data,
-    confidence: options?.confidence ?? 1,
-    metadata: {
-      latencyMs: options?.latencyMs,
-      sourceUrl: options?.sourceUrl,
-      tags: options?.tags ?? [],
-    },
-  };
-}
+): Observation {}
 
 /**
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a valid UUID; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a timestamp; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observations validate against schema
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
bronze/P0_LIDLESS_LEGION/contracts/index.ts:118:12
     id: crypto.randomUUID(),
     timestamp: Date.now(),
     source,
-    query: options?.query,
+    query: options.query,
     data,
     confidence: options?.confidence ?? 1,
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a valid UUID; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a timestamp; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: Cannot read properties of undefined (reading 'query')

[Killed] LogicalOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:120:17
     source,
     query: options?.query,
     data,
-    confidence: options?.confidence ?? 1,
+    confidence: options?.confidence && 1,
     metadata: {
       latencyMs: options?.latencyMs,
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] OptionalChaining
bronze/P0_LIDLESS_LEGION/contracts/index.ts:120:17
     source,
     query: options?.query,
     data,
-    confidence: options?.confidence ?? 1,
+    confidence: options.confidence ?? 1,
     metadata: {
       latencyMs: options?.latencyMs,
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a valid UUID; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a timestamp; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: Cannot read properties of undefined (reading 'confidence')

[Killed] ObjectLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:121:15
     query: options?.query,
     data,
     confidence: options?.confidence ?? 1,
-    metadata: {
-      latencyMs: options?.latencyMs,
-      sourceUrl: options?.sourceUrl,
-      tags: options?.tags ?? [],
-    },
+    metadata: {},
   };
 }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] OptionalChaining
bronze/P0_LIDLESS_LEGION/contracts/index.ts:122:18
     data,
     confidence: options?.confidence ?? 1,
     metadata: {
-      latencyMs: options?.latencyMs,
+      latencyMs: options.latencyMs,
       sourceUrl: options?.sourceUrl,
       tags: options?.tags ?? [],
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a valid UUID; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a timestamp; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: Cannot read properties of undefined (reading 'latencyMs')

[Killed] OptionalChaining
bronze/P0_LIDLESS_LEGION/contracts/index.ts:123:18
     confidence: options?.confidence ?? 1,
     metadata: {
       latencyMs: options?.latencyMs,
-      sourceUrl: options?.sourceUrl,
+      sourceUrl: options.sourceUrl,
       tags: options?.tags ?? [],
     },
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a valid UUID; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a timestamp; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: Cannot read properties of undefined (reading 'sourceUrl')

[Killed] LogicalOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:124:13
     metadata: {
       latencyMs: options?.latencyMs,
       sourceUrl: options?.sourceUrl,
-      tags: options?.tags ?? [],
+      tags: options?.tags && [],
     },
   };
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [] to have a length of 2 but got +0

[Killed] OptionalChaining
bronze/P0_LIDLESS_LEGION/contracts/index.ts:124:13
     metadata: {
       latencyMs: options?.latencyMs,
       sourceUrl: options?.sourceUrl,
-      tags: options?.tags ?? [],
+      tags: options.tags ?? [],
     },
   };
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a valid UUID; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant every observation has a timestamp; P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: Cannot read properties of undefined (reading 'tags')

[Killed] ConditionalExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:136:7
   let results = observations;
   
   // Filter by source
-  if (filter.sources && filter.sources.length > 0) {
+  if (true) {
     results = results.filter(o => filter.sources!.includes(o.source));
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence; P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match); P0 LIDLESS LEGION - Property Tests Observation Filtering respects limit
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
bronze/P0_LIDLESS_LEGION/contracts/index.ts:136:52
   let results = observations;
   
   // Filter by source
-  if (filter.sources && filter.sources.length > 0) {
-    results = results.filter(o => filter.sources!.includes(o.source));
-  }
+  if (filter.sources && filter.sources.length > 0) {}
   
   // Filter by confidence
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by source
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] ArrowFunction
bronze/P0_LIDLESS_LEGION/contracts/index.ts:137:30
   
   // Filter by source
   if (filter.sources && filter.sources.length > 0) {
-    results = results.filter(o => filter.sources!.includes(o.source));
+    results = results.filter(() => undefined);
   }
   
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by source
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:137:15
   
   // Filter by source
   if (filter.sources && filter.sources.length > 0) {
-    results = results.filter(o => filter.sources!.includes(o.source));
+    results = results;
   }
   
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by source
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] BlockStatement
bronze/P0_LIDLESS_LEGION/contracts/index.ts:141:43
   }
   
   // Filter by confidence
-  if (filter.minConfidence !== undefined) {
-    results = results.filter(o => o.confidence >= filter.minConfidence!);
-  }
+  if (filter.minConfidence !== undefined) {}
   
   // Filter by tags
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] ConditionalExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:141:7
   }
   
   // Filter by confidence
-  if (filter.minConfidence !== undefined) {
+  if (false) {
     results = results.filter(o => o.confidence >= filter.minConfidence!);
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] ConditionalExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:142:35
   
   // Filter by confidence
   if (filter.minConfidence !== undefined) {
-    results = results.filter(o => o.confidence >= filter.minConfidence!);
+    results = results.filter(o => false);
   }
   
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:142:15
   
   // Filter by confidence
   if (filter.minConfidence !== undefined) {
-    results = results.filter(o => o.confidence >= filter.minConfidence!);
+    results = results;
   }
   
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] LogicalOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:146:7
   }
   
   // Filter by tags
-  if (filter.tags && filter.tags.length > 0) {
+  if (filter.tags || filter.tags.length > 0) {
     results = results.filter(o => 
       filter.tags!.every(tag => o.metadata.tags.includes(tag))
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by source; P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence; P0 LIDLESS LEGION - Property Tests Observation Filtering respects limit
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:146:22
   }
   
   // Filter by tags
-  if (filter.tags && filter.tags.length > 0) {
+  if (filter.tags && filter.tags.length <= 0) {
     results = results.filter(o => 
       filter.tags!.every(tag => o.metadata.tags.includes(tag))
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:147:15
   
   // Filter by tags
   if (filter.tags && filter.tags.length > 0) {
-    results = results.filter(o => 
-      filter.tags!.every(tag => o.metadata.tags.includes(tag))
-    );
+    results = results;
   }
   
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] ArrowFunction
bronze/P0_LIDLESS_LEGION/contracts/index.ts:147:30
   
   // Filter by tags
   if (filter.tags && filter.tags.length > 0) {
-    results = results.filter(o => 
-      filter.tags!.every(tag => o.metadata.tags.includes(tag))
+    results = results.filter(() => undefined
     );
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
bronze/P0_LIDLESS_LEGION/contracts/index.ts:148:26
   // Filter by tags
   if (filter.tags && filter.tags.length > 0) {
     results = results.filter(o => 
-      filter.tags!.every(tag => o.metadata.tags.includes(tag))
+      filter.tags!.every(() => undefined)
     );
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:148:7
   // Filter by tags
   if (filter.tags && filter.tags.length > 0) {
     results = results.filter(o => 
-      filter.tags!.every(tag => o.metadata.tags.includes(tag))
+      filter.tags!.some(tag => o.metadata.tags.includes(tag))
     );
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [ { …(7) }, { …(7) } ] to have a length of 1 but got 2

[Killed] EqualityOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:153:7
   }
   
   // Filter by timestamp
-  if (filter.since !== undefined) {
+  if (filter.since === undefined) {
     results = results.filter(o => o.timestamp >= filter.since!);
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by source; P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence; P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:153:7
   }
   
   // Filter by timestamp
-  if (filter.since !== undefined) {
+  if (true) {
     results = results.filter(o => o.timestamp >= filter.since!);
   }
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering filters by source; P0 LIDLESS LEGION - Property Tests Observation Filtering filters by minimum confidence; P0 LIDLESS LEGION - Property Tests Observation Filtering filters by tags (all must match)
statusReason: expected [] to have a length of 2 but got +0

[NoCoverage] EqualityOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:154:35
   
   // Filter by timestamp
   if (filter.since !== undefined) {
-    results = results.filter(o => o.timestamp >= filter.since!);
+    results = results.filter(o => o.timestamp < filter.since!);
   }
   

[NoCoverage] EqualityOperator
bronze/P0_LIDLESS_LEGION/contracts/index.ts:154:35
   
   // Filter by timestamp
   if (filter.since !== undefined) {
-    results = results.filter(o => o.timestamp >= filter.since!);
+    results = results.filter(o => o.timestamp > filter.since!);
   }
   

[Killed] MethodExpression
bronze/P0_LIDLESS_LEGION/contracts/index.ts:158:10
   }
   
   // Apply limit
-  return results.slice(0, filter.limit);
+  return results;
 }
 
killedBy: P0 LIDLESS LEGION - Property Tests Observation Filtering respects limit
statusReason: expected [ { …(7) }, { …(7) }, { …(7) }, …(1) ] to have a length of 2 but got 4

[Killed] BlockStatement
bronze/P0_LIDLESS_LEGION/contracts/index.ts:164:106
 /**
  * Merges multiple observations into a batch
  */
-export function batchObservations(observations: Observation[], correlationId?: string): ObservationBatch {
-  return {
-    id: crypto.randomUUID(),
-    timestamp: Date.now(),
-    observations,
-    correlationId,
-  };
-}
+export function batchObservations(observations: Observation[], correlationId?: string): ObservationBatch {}
 
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
bronze/P0_LIDLESS_LEGION/contracts/index.ts:165:10
  * Merges multiple observations into a batch
  */
 export function batchObservations(observations: Observation[], correlationId?: string): ObservationBatch {
-  return {
-    id: crypto.randomUUID(),
-    timestamp: Date.now(),
-    observations,
-    correlationId,
-  };
+  return {};
 }
 
killedBy: P0 LIDLESS LEGION - Property Tests Property 2: Observation Logging Invariant observation batches validate against schema
statusReason: expected false to be true // Object.is equality
