[Killed] ObjectLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:30:47
 
 // --- VACUOLE ENVELOPE ---
 
-export const VacuoleEnvelopeSchema = z.object({
-  id: z.string().uuid(),
-  timestamp: z.number(),
-  sourcePort: z.number().min(0).max(7),
-  targetPort: z.number().min(0).max(7),
-  verb: VerbSchema,
-  payload: z.unknown(),
-  metadata: z.object({
-    ttl: z.number().default(60000),
-    priority: z.enum(['low', 'normal', 'high', 'critical']),
-    correlationId: z.string().optional(),
-  }),
-});
+export const VacuoleEnvelopeSchema = z.object({});
 
 export type VacuoleEnvelope = z.infer<typeof VacuoleEnvelopeSchema>;
killedBy: P1 Web Weaver WebWeaver class validateEnvelope rejects invalid envelopes
statusReason: expected true to be false // Object.is equality

[Survived] ObjectLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:37:22
   targetPort: z.number().min(0).max(7),
   verb: VerbSchema,
   payload: z.unknown(),
-  metadata: z.object({
-    ttl: z.number().default(60000),
-    priority: z.enum(['low', 'normal', 'high', 'critical']),
-    correlationId: z.string().optional(),
-  }),
+  metadata: z.object({}),
 });
 

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:39:40
   payload: z.unknown(),
   metadata: z.object({
     ttl: z.number().default(60000),
-    priority: z.enum(['low', 'normal', 'high', 'critical']),
+    priority: z.enum(['low', 'normal', "", 'critical']),
     correlationId: z.string().optional(),
   }),
killedBy: VacuoleEnvelope Schema Validation all valid envelopes pass schema validation; VacuoleEnvelope Schema Validation wrapEnvelope creates valid envelopes for all inputs; P1 Web Weaver wrapEnvelope() envelope passes schema validation
statusReason: Property failed after 8 tests
{ seed: 1285249842, path: "7:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"id":"00000000-0000-1000-8000-000000000000","timestamp":0,"sourcePort":0,"targetPort":0,"verb":"OBSERVE","payload":0,"metadata":{"ttl":0,"priority":"high","correlationId":undefined}}]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values e

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:39:30
   payload: z.unknown(),
   metadata: z.object({
     ttl: z.number().default(60000),
-    priority: z.enum(['low', 'normal', 'high', 'critical']),
+    priority: z.enum(['low', "", 'high', 'critical']),
     correlationId: z.string().optional(),
   }),
killedBy: VacuoleEnvelope Schema Validation all valid envelopes pass schema validation; VacuoleEnvelope Schema Validation wrapEnvelope creates valid envelopes for all inputs; P1 Web Weaver WebWeaver class validateEnvelope accepts valid envelopes
statusReason: Property failed after 4 tests
{ seed: 1306679645, path: "3:0:0:0:0:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"id":"00000000-0000-1000-8000-000000000000","timestamp":0,"sourcePort":0,"targetPort":0,"verb":"OBSERVE","payload":{},"metadata":{"ttl":0,"priority":"normal","correlationId":undefined}}]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing val

[Killed] MethodExpression
bronze/P1_WEB_WEAVER/contracts/index.ts:50:18
 
 export const SilverPromotionReceiptSchema = z.object({
   artifact: z.string(),
-  mutationScore: z.number().min(80).max(98.99),
+  mutationScore: z.number().max(80).max(98.99),
   timestamp: z.string(),
   hash: z.string().regex(/^sha256:[a-f0-9]{64}$/),
killedBy: SilverPromotionReceipt Schema Validation all valid receipts pass schema validation; SilverPromotionReceipt Schema Validation receipts with score < 80 fail validation; P1 Web Weaver WebWeaver class validateReceipt accepts valid receipts
statusReason: Property failed after 1 tests
{ seed: -80640550, path: "0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1:1", endOnFailure: true }
Counterexample: [{"artifact":" ","mutationScore":80.00000000000001,"timestamp":"

[Killed] MethodExpression
bronze/P1_WEB_WEAVER/contracts/index.ts:50:18
 
 export const SilverPromotionReceiptSchema = z.object({
   artifact: z.string(),
-  mutationScore: z.number().min(80).max(98.99),
+  mutationScore: z.number().min(80).min(98.99),
   timestamp: z.string(),
   hash: z.string().regex(/^sha256:[a-f0-9]{64}$/),
killedBy: SilverPromotionReceipt Schema Validation all valid receipts pass schema validation; SilverPromotionReceipt Schema Validation receipts with score > 98.99 fail validation; P1 Web Weaver WebWeaver class validateReceipt accepts valid receipts
statusReason: Property failed after 1 tests
{ seed: 1455311978, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"artifact":" ","mutationScore":80,"timestamp":" ","hash":"sha256:0000000000000000000000000000000000000000000000000000000000000000","strykerConfig":" ","propertyTe

[Killed] Regex
bronze/P1_WEB_WEAVER/contracts/index.ts:52:26
   artifact: z.string(),
   mutationScore: z.number().min(80).max(98.99),
   timestamp: z.string(),
-  hash: z.string().regex(/^sha256:[a-f0-9]{64}$/),
+  hash: z.string().regex(/^sha256:[^a-f0-9]{64}$/),
   strykerConfig: z.string(),
   propertyTestsPassed: z.boolean(),
killedBy: SilverPromotionReceipt Schema Validation all valid receipts pass schema validation; P1 Web Weaver WebWeaver class validateReceipt accepts valid receipts
statusReason: Property failed after 1 tests
{ seed: -657160463, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"artifact":" ","mutationScore":80,"timestamp":" ","hash":"sha256:0000000000000000000000000000000000000000000000000000000000000000","strykerConfig":" ","propertyTestsP

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:68:20
   timestamp: z.number(),
   sourcePort: z.number().min(0).max(7),
   eventType: z.enum([
-    'OBSERVATION', 'BRIDGE', 'TRANSFORM', 'INJECTION',
+    'OBSERVATION', "", 'TRANSFORM', 'INJECTION',
     'VIOLATION', 'IMMUNIZATION', 'ASSIMILATION', 'DECISION',
     'PROMOTION', 'DEMOTION', 'REBIRTH'
killedBy: StigmergyEvent Schema Validation validates all eventType enum values; StigmergyEvent Schema Validation rejects invalid eventType values; StigmergyEvent Schema Validation validates sourcePort bounds (0-7)
statusReason: eventType "BRIDGE" should be valid: expected false to be true // Object.is equality

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:68:30
   timestamp: z.number(),
   sourcePort: z.number().min(0).max(7),
   eventType: z.enum([
-    'OBSERVATION', 'BRIDGE', 'TRANSFORM', 'INJECTION',
+    'OBSERVATION', 'BRIDGE', "", 'INJECTION',
     'VIOLATION', 'IMMUNIZATION', 'ASSIMILATION', 'DECISION',
     'PROMOTION', 'DEMOTION', 'REBIRTH'
killedBy: StigmergyEvent Schema Validation validates all eventType enum values; StigmergyEvent Schema Validation rejects invalid eventType values; StigmergyEvent Schema Validation all valid stigmergy events pass validation
statusReason: eventType "TRANSFORM" should be valid: expected false to be true // Object.is equality

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:69:18
   sourcePort: z.number().min(0).max(7),
   eventType: z.enum([
     'OBSERVATION', 'BRIDGE', 'TRANSFORM', 'INJECTION',
-    'VIOLATION', 'IMMUNIZATION', 'ASSIMILATION', 'DECISION',
+    'VIOLATION', "", 'ASSIMILATION', 'DECISION',
     'PROMOTION', 'DEMOTION', 'REBIRTH'
   ]),
killedBy: StigmergyEvent Schema Validation validates all eventType enum values; StigmergyEvent Schema Validation rejects invalid eventType values; StigmergyEvent Schema Validation all valid stigmergy events pass validation
statusReason: eventType "IMMUNIZATION" should be valid: expected false to be true // Object.is equality

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:69:34
   sourcePort: z.number().min(0).max(7),
   eventType: z.enum([
     'OBSERVATION', 'BRIDGE', 'TRANSFORM', 'INJECTION',
-    'VIOLATION', 'IMMUNIZATION', 'ASSIMILATION', 'DECISION',
+    'VIOLATION', 'IMMUNIZATION', "", 'DECISION',
     'PROMOTION', 'DEMOTION', 'REBIRTH'
   ]),
killedBy: StigmergyEvent Schema Validation validates all eventType enum values; StigmergyEvent Schema Validation rejects invalid eventType values; StigmergyEvent Schema Validation all valid stigmergy events pass validation
statusReason: eventType "ASSIMILATION" should be valid: expected false to be true // Object.is equality

[Killed] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:70:5
   eventType: z.enum([
     'OBSERVATION', 'BRIDGE', 'TRANSFORM', 'INJECTION',
     'VIOLATION', 'IMMUNIZATION', 'ASSIMILATION', 'DECISION',
-    'PROMOTION', 'DEMOTION', 'REBIRTH'
+    "", 'DEMOTION', 'REBIRTH'
   ]),
   payload: z.unknown(),
killedBy: StigmergyEvent Schema Validation validates all eventType enum values; StigmergyEvent Schema Validation rejects invalid eventType values; StigmergyEvent Schema Validation validates correlationId is optional
statusReason: eventType "PROMOTION" should be valid: expected false to be true // Object.is equality

[Killed] ConditionalExpression
bronze/P1_WEB_WEAVER/contracts/index.ts:86:7
  */
 export function bridge<T>(message: unknown, schema: z.ZodType<T>): { success: true; data: T } | { success: false; errors: string[] } {
   const result = schema.safeParse(message);
-  if (result.success) {
+  if (false) {
     return { success: true, data: result.data };
   }
killedBy: Property 4: Message Bridging Validation bridge returns success for all valid messages; Property 4: Message Bridging Validation bridged messages preserve data integrity; P1 Web Weaver bridge() validates valid messages against schema
statusReason: Property failed after 1 tests
{ seed: 1195901962, path: "0:0:0", endOnFailure: true }
Counterexample: [{"name":" ","value":0}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:91:42
   }
   return {
     success: false,
-    errors: result.error.errors.map(e => `${e.path.join('.')}: ${e.message}`),
+    errors: result.error.errors.map(e => ``),
   };
 }

[Killed] BlockStatement
bronze/P1_WEB_WEAVER/contracts/index.ts:119:20
   verb: Verb,
   payload: unknown,
   priority: 'low' | 'normal' | 'high' | 'critical' = 'normal'
-): VacuoleEnvelope {
-  return {
-    id: crypto.randomUUID(),
-    timestamp: Date.now(),
-    sourcePort,
-    targetPort,
-    verb,
-    payload,
-    metadata: {
-      ttl: 60000,
-      priority,
-    },
-  };
-}
+): VacuoleEnvelope {}
 
killedBy: VacuoleEnvelope Schema Validation wrapEnvelope creates valid envelopes for all inputs; P1 Web Weaver wrapEnvelope() creates valid VacuoleEnvelope; P1 Web Weaver wrapEnvelope() envelope passes schema validation
statusReason: Property failed after 1 tests
{ seed: 910044502, path: "0:0:0:0:0", endOnFailure: true }
Counterexample: [0,0,"OBSERVE",{},"low"]
Shrunk 4 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
bronze/P1_WEB_WEAVER/contracts/index.ts:120:10
   payload: unknown,
   priority: 'low' | 'normal' | 'high' | 'critical' = 'normal'
 ): VacuoleEnvelope {
-  return {
-    id: crypto.randomUUID(),
-    timestamp: Date.now(),
-    sourcePort,
-    targetPort,
-    verb,
-    payload,
-    metadata: {
-      ttl: 60000,
-      priority,
-    },
-  };
+  return {};
 }
 
killedBy: P1 Web Weaver wrapEnvelope() creates valid VacuoleEnvelope; P1 Web Weaver wrapEnvelope() envelope passes schema validation; P1 Web Weaver WebWeaver class validateEnvelope accepts valid envelopes
statusReason: expected undefined to be 1 // Object.is equality
