[Survived] BlockStatement
src/stages/fsm/gesture-fsm.ts:54:56
 /**
  * Check if gesture is in valid vocabulary
  */
-function isValidGesture(gesture: GestureName): boolean {
-  return VALID_GESTURES.has(gesture);
-}
+function isValidGesture(gesture: GestureName): boolean {}
 
 /**

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:61:66
 /**
  * Check if palm is within cone angle
  */
-function isInCone(palmAngle: number, coneAngle: number): boolean {
-  return Math.abs(palmAngle) <= coneAngle / 2;
-}
+function isInCone(palmAngle: number, coneAngle: number): boolean {}
 
 /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 43ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:62:10
  * Check if palm is within cone angle
  */
 function isInCone(palmAngle: number, coneAngle: number): boolean {
-  return Math.abs(palmAngle) <= coneAngle / 2;
+  return false;
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 50ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:62:10
  * Check if palm is within cone angle
  */
 function isInCone(palmAngle: number, coneAngle: number): boolean {
-  return Math.abs(palmAngle) <= coneAngle / 2;
+  return true;
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 130ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 39ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:73:12
   enterThreshold: number,
   exitThreshold: number,
   isEntering: boolean
-): boolean {
-  return isEntering ? confidence >= enterThreshold : confidence >= exitThreshold;
-}
+): boolean {}
 
 /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 33ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:74:23
   exitThreshold: number,
   isEntering: boolean
 ): boolean {
-  return isEntering ? confidence >= enterThreshold : confidence >= exitThreshold;
+  return isEntering ? confidence < enterThreshold : confidence >= exitThreshold;
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 34ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 51ms

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:74:54
   exitThreshold: number,
   isEntering: boolean
 ): boolean {
-  return isEntering ? confidence >= enterThreshold : confidence >= exitThreshold;
+  return isEntering ? confidence >= enterThreshold : true;
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 35ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 52ms

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:84:12
   dwellStartTime: number | null,
   currentTime: number,
   dwellTime: number
-): boolean {
-  if (dwellStartTime === null) return false;
-  return (currentTime - dwellStartTime) >= dwellTime;
-}
+): boolean {}
 
 /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:85:7
   currentTime: number,
   dwellTime: number
 ): boolean {
-  if (dwellStartTime === null) return false;
+  if (true) return false;
   return (currentTime - dwellStartTime) >= dwellTime;
 }
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead


 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 130ms

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:85:7
   currentTime: number,
   dwellTime: number
 ): boolean {
-  if (dwellStartTime === null) return false;
+  if (dwellStartTime !== null) return false;
   return (currentTime - dwellStartTime) >= dwellTime;
 }
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 52ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:86:10
   dwellTime: number
 ): boolean {
   if (dwellStartTime === null) return false;
-  return (currentTime - dwellStartTime) >= dwellTime;
+  return false;
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 33ms

 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 142ms

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:86:10
   dwellTime: number
 ): boolean {
   if (dwellStartTime === null) return false;
-  return (currentTime - dwellStartTime) >= dwellTime;
+  return currentTime - dwellStartTime < dwellTime;
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 48ms

 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 197ms

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:114:22
           GESTURE_UPDATE: [
             {
               // Transition to ARMED if Open_Palm in cone with confidence
-              guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
+              guard: () => undefined,
               target: 'ARMED_DWELL',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 51ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:115:17
             {
               // Transition to ARMED if Open_Palm in cone with confidence
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
+                false,
               target: 'ARMED_DWELL',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 35ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 53ms

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:115:17
             {
               // Transition to ARMED if Open_Palm in cone with confidence
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
+                event.gesture !== 'Open_Palm' &&
                 isInCone(event.palmAngle, context.config.coneAngle) &&
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 47ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BooleanLiteral
src/stages/fsm/gesture-fsm.ts:117:111
               guard: ({ event, context }) =>
                 event.gesture === 'Open_Palm' &&
                 isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
+                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
               target: 'ARMED_DWELL',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ❯ src/stages/fsm/gesture-fsm.test.ts (35 tests | 4 failed) 454ms

   × GestureFSM > Unit Tests > should kill hysteresis survivors with edge cases 14ms
     → expected 'ARMED_DWELL' to be 'IDLE' // Object.is equality

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:120:27
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
               target: 'ARMED_DWELL',
               actions: assign({
-                position: ({ event }) => event.position,
+                position: () => undefined,
                 gesture: ({ event }) => event.gesture,
                 confidence: ({ event }) => event.confidence,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 46ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:121:26
               target: 'ARMED_DWELL',
               actions: assign({
                 position: ({ event }) => event.position,
-                gesture: ({ event }) => event.gesture,
+                gesture: () => undefined,
                 confidence: ({ event }) => event.confidence,
                 palmAngle: ({ event }) => event.palmAngle,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:122:29
               actions: assign({
                 position: ({ event }) => event.position,
                 gesture: ({ event }) => event.gesture,
-                confidence: ({ event }) => event.confidence,
+                confidence: () => undefined,
                 palmAngle: ({ event }) => event.palmAngle,
                 dwellStartTime: ({ event }) => event.timestamp,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 48ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 38ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:123:28
                 position: ({ event }) => event.position,
                 gesture: ({ event }) => event.gesture,
                 confidence: ({ event }) => event.confidence,
-                palmAngle: ({ event }) => event.palmAngle,
+                palmAngle: () => undefined,
                 dwellStartTime: ({ event }) => event.timestamp,
                 lastActiveTime: ({ event }) => event.timestamp,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead


 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 49ms

[Timeout] ArrowFunction
src/stages/fsm/gesture-fsm.ts:124:33
                 gesture: ({ event }) => event.gesture,
                 confidence: ({ event }) => event.confidence,
                 palmAngle: ({ event }) => event.palmAngle,
-                dwellStartTime: ({ event }) => event.timestamp,
+                dwellStartTime: () => undefined,
                 lastActiveTime: ({ event }) => event.timestamp,
               }),

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:125:33
                 confidence: ({ event }) => event.confidence,
                 palmAngle: ({ event }) => event.palmAngle,
                 dwellStartTime: ({ event }) => event.timestamp,
-                lastActiveTime: ({ event }) => event.timestamp,
+                lastActiveTime: () => undefined,
               }),
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 56ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 39ms

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:135:33
                 gesture: ({ event }) => event.gesture,
                 confidence: ({ event }) => event.confidence,
                 palmAngle: ({ event }) => event.palmAngle,
-                lastActiveTime: ({ event }) => event.timestamp,
+                lastActiveTime: () => undefined,
               }),
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 147ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 49ms

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:150:22
           GESTURE_UPDATE: [
             {
               // Dwell complete, transition to ARMED
-              guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false) &&
-                dwellElapsed(context.dwellStartTime, event.timestamp, context.config.dwellTime),
+              guard: () => undefined,
               target: 'ARMED',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 222ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:151:17
             {
               // Dwell complete, transition to ARMED
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false) &&
-                dwellElapsed(context.dwellStartTime, event.timestamp, context.config.dwellTime),
+                true,
               target: 'ARMED',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Survived] BooleanLiteral
src/stages/fsm/gesture-fsm.ts:153:111
               guard: ({ event, context }) =>
                 event.gesture === 'Open_Palm' &&
                 isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false) &&
+                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true) &&
                 dwellElapsed(context.dwellStartTime, event.timestamp, context.config.dwellTime),
               target: 'ARMED',

[Timeout] ArrowFunction
src/stages/fsm/gesture-fsm.ts:167:22
             },
             {
               // Still dwelling, update context
-              guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+              guard: () => undefined,
               actions: assign({
                 position: ({ event }) => event.position,

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:168:17
             {
               // Still dwelling, update context
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+                false,
               actions: assign({
                 position: ({ event }) => event.position,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:168:17
             {
               // Still dwelling, update context
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+                true,
               actions: assign({
                 position: ({ event }) => event.position,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 47ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BooleanLiteral
src/stages/fsm/gesture-fsm.ts:170:111
               guard: ({ event, context }) =>
                 event.gesture === 'Open_Palm' &&
                 isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
               actions: assign({
                 position: ({ event }) => event.position,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 40ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 49ms

[Timeout] ArrowFunction
src/stages/fsm/gesture-fsm.ts:200:22
           GESTURE_UPDATE: [
             {
               // Pointing_Up detected, start dwell for ENGAGED
-              guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
+              guard: () => undefined,
               target: 'ENGAGED_DWELL',
               actions: assign({

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:201:17
             {
               // Pointing_Up detected, start dwell for ENGAGED
               guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
+                event.gesture !== 'Pointing_Up' &&
                 isInCone(event.palmAngle, context.config.coneAngle) &&
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 35ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 50ms

[Killed] LogicalOperator
src/stages/fsm/gesture-fsm.ts:201:17
             {
               // Pointing_Up detected, start dwell for ENGAGED
               guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
+                event.gesture === 'Pointing_Up' || isInCone(event.palmAngle, context.config.coneAngle) &&
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, true),
               target: 'ENGAGED_DWELL',
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 49ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 37ms

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:216:22
             },
             {
               // Still Open_Palm in cone, stay ARMED
-              guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+              guard: () => undefined,
               actions: assign({
                 position: ({ event }) => event.position,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:217:17
             {
               // Still Open_Palm in cone, stay ARMED
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
+                true &&
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Timeout] ArrayDeclaration
src/stages/fsm/gesture-fsm.ts:233:20
               target: 'IDLE',
             },
           ],
-          NO_HAND: [
-            {
-              // Check timeout
-              guard: ({ event, context }) =>
-                (event.timestamp - context.lastActiveTime) > context.config.timeout,
-              target: 'IDLE',
-            },
-            {
-              // Within timeout, stay ARMED
-            },
-          ],
+          NO_HAND: [],
         },
       },

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:236:22
           NO_HAND: [
             {
               // Check timeout
-              guard: ({ event, context }) =>
-                (event.timestamp - context.lastActiveTime) > context.config.timeout,
+              guard: () => undefined,
               target: 'IDLE',
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:237:17
             {
               // Check timeout
               guard: ({ event, context }) =>
-                (event.timestamp - context.lastActiveTime) > context.config.timeout,
+                event.timestamp - context.lastActiveTime <= context.config.timeout,
               target: 'IDLE',
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 57ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 35ms

[Killed] ArithmeticOperator
src/stages/fsm/gesture-fsm.ts:237:18
             {
               // Check timeout
               guard: ({ event, context }) =>
-                (event.timestamp - context.lastActiveTime) > context.config.timeout,
+                (event.timestamp + context.lastActiveTime) > context.config.timeout,
               target: 'IDLE',
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 35ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Timeout] ArrowFunction
src/stages/fsm/gesture-fsm.ts:252:22
           GESTURE_UPDATE: [
             {
               // Dwell complete, transition to ENGAGED (pointerdown)
-              guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false) &&
-                dwellElapsed(context.dwellStartTime, event.timestamp, context.config.dwellTime),
+              guard: () => undefined,
               target: 'ENGAGED',
               actions: assign({
