[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:253:17
             {
               // Dwell complete, transition to ENGAGED (pointerdown)
               guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false) &&
-                dwellElapsed(context.dwellStartTime, event.timestamp, context.config.dwellTime),
+                true,
               target: 'ENGAGED',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 50ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Survived] ArrowFunction
src/stages/fsm/gesture-fsm.ts:269:22
             },
             {
               // Still dwelling
-              guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+              guard: () => undefined,
               actions: assign({
                 position: ({ event }) => event.position,

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:270:17
             {
               // Still dwelling
               guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+                true,
               actions: assign({
                 position: ({ event }) => event.position,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 56ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 37ms

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:270:17
             {
               // Still dwelling
               guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
+                true &&
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/testing/integration.test.ts > Integration Tests > Frame Drop → Coast → Snap-Lock Sequence > should coast during tracking loss and snap-lock on resume
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:283:22
             },
             {
               // Gesture changed, back to ARMED
-              guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle),
+              guard: () => undefined,
               target: 'ARMED',
               actions: assign({ dwellStartTime: null }),
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 37ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 51ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:284:17
             {
               // Gesture changed, back to ARMED
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle),
+                false,
               target: 'ARMED',
               actions: assign({ dwellStartTime: null }),
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 38ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 51ms

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:308:22
           GESTURE_UPDATE: [
             {
               // Open_Palm detected, transition to ARMED (pointerup)
-              guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+              guard: () => undefined,
               target: 'ARMED',
               actions: assign({
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 48ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 38ms

[Killed] LogicalOperator
src/stages/fsm/gesture-fsm.ts:309:17
             {
               // Open_Palm detected, transition to ARMED (pointerup)
               guard: ({ event, context }) =>
-                event.gesture === 'Open_Palm' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
+                event.gesture === 'Open_Palm' || isInCone(event.palmAngle, context.config.coneAngle) &&
                 meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
               target: 'ARMED',
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:323:22
             },
             {
               // Still Pointing_Up, stay ENGAGED
-              guard: ({ event, context }) =>
-                event.gesture === 'Pointing_Up' &&
-                isInCone(event.palmAngle, context.config.coneAngle) &&
-                meetsThreshold(event.confidence, context.config.enterThreshold, context.config.exitThreshold, false),
+              guard: () => undefined,
               actions: assign({
                 position: ({ event }) => event.position,
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 38ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 51ms

[Killed] ArrowFunction
src/stages/fsm/gesture-fsm.ts:343:22
           NO_HAND: [
             {
               // Timeout, back to IDLE (pointercancel)
-              guard: ({ event, context }) =>
-                (event.timestamp - context.lastActiveTime) > context.config.timeout,
+              guard: () => undefined,
               target: 'IDLE',
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 55ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:344:17
             {
               // Timeout, back to IDLE (pointercancel)
               guard: ({ event, context }) =>
-                (event.timestamp - context.lastActiveTime) > context.config.timeout,
+                false,
               target: 'IDLE',
             },
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:366:53
   private previousState: FSMState = 'IDLE';
   private config: FSMStageConfig;
 
-  constructor(config: Partial<FSMStageConfig> = {}) {
-    this.config = FSMStageConfigSchema.parse(config);
-    this.machine = createGestureMachine(this.config);
-    this.actor = createActor(this.machine);
-    this.actor.start();
-  }
+  constructor(config: Partial<FSMStageConfig> = {}) {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 144ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 47ms

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:382:23
     palmAngle: number,
     position: Point2D,
     timestamp: number
-  ): GestureFSMOutput {
-    const prevState = this.getState();
-    
-    this.actor.send({
-      type: 'GESTURE_UPDATE',
-      gesture,
-      confidence,
-      palmAngle,
-      position,
-      timestamp,
-    });
-
-    const newState = this.getState();
-    const action = this.determineAction(prevState, newState);
-    
-    this.previousState = newState;
-
-    return {
-      state: newState,
-      action,
-      position: this.actor.getSnapshot().context.position,
-    };
-  }
+  ): GestureFSMOutput {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:409:47
   /**
    * Process no_hand event
    */
-  noHand(timestamp: number): GestureFSMOutput {
-    const prevState = this.getState();
-    
-    this.actor.send({ type: 'NO_HAND', timestamp });
-
-    const newState = this.getState();
-    const action = this.determineAction(prevState, newState);
-    
-    this.previousState = newState;
-
-    return {
-      state: newState,
-      action,
-      position: this.actor.getSnapshot().context.position,
-    };
-  }
+  noHand(timestamp: number): GestureFSMOutput {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:429:79
   /**
    * Determine action based on state transition
    */
-  private determineAction(prevState: FSMState, newState: FSMState): FSMAction {
-    // Map internal states to external states
-    const mapState = (s: string): FSMState => {
-      if (s === 'ARMED_DWELL') return 'IDLE';
-      if (s === 'ENGAGED_DWELL') return 'ARMED';
-      return s as FSMState;
-    };
-
-    const prev = mapState(prevState);
-    const next = mapState(newState);
-
-    // State transition actions
-    if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
-    if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
-    if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
-    
-    // Movement actions
-    if (next === 'ARMED' || next === 'ENGAGED') return 'MOVE';
-    
-    return 'NONE';
-  }
+  private determineAction(prevState: FSMState, newState: FSMState): FSMAction {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:431:47
    */
   private determineAction(prevState: FSMState, newState: FSMState): FSMAction {
     // Map internal states to external states
-    const mapState = (s: string): FSMState => {
-      if (s === 'ARMED_DWELL') return 'IDLE';
-      if (s === 'ENGAGED_DWELL') return 'ARMED';
-      return s as FSMState;
-    };
+    const mapState = (s: string): FSMState => {};
 
     const prev = mapState(prevState);
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 40ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 87ms

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:432:11
   private determineAction(prevState: FSMState, newState: FSMState): FSMAction {
     // Map internal states to external states
     const mapState = (s: string): FSMState => {
-      if (s === 'ARMED_DWELL') return 'IDLE';
+      if (true) return 'IDLE';
       if (s === 'ENGAGED_DWELL') return 'ARMED';
       return s as FSMState;
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 73ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:432:11
   private determineAction(prevState: FSMState, newState: FSMState): FSMAction {
     // Map internal states to external states
     const mapState = (s: string): FSMState => {
-      if (s === 'ARMED_DWELL') return 'IDLE';
+      if (s !== 'ARMED_DWELL') return 'IDLE';
       if (s === 'ENGAGED_DWELL') return 'ARMED';
       return s as FSMState;
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 50ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:433:11
     // Map internal states to external states
     const mapState = (s: string): FSMState => {
       if (s === 'ARMED_DWELL') return 'IDLE';
-      if (s === 'ENGAGED_DWELL') return 'ARMED';
+      if (true) return 'ARMED';
       return s as FSMState;
     };
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 72ms

 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 163ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 36ms

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:433:11
     // Map internal states to external states
     const mapState = (s: string): FSMState => {
       if (s === 'ARMED_DWELL') return 'IDLE';
-      if (s === 'ENGAGED_DWELL') return 'ARMED';
+      if (s !== 'ENGAGED_DWELL') return 'ARMED';
       return s as FSMState;
     };
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 37ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] LogicalOperator
src/stages/fsm/gesture-fsm.ts:441:9
     const next = mapState(newState);
 
     // State transition actions
-    if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
+    if (prev === 'ARMED' || next === 'ENGAGED') return 'DOWN';
     if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
     if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:441:29
     const next = mapState(newState);
 
     // State transition actions
-    if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
+    if (prev === 'ARMED' && true) return 'DOWN';
     if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
     if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 34ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:442:9
 
     // State transition actions
     if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
-    if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
+    if (false) return 'UP';
     if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
     
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 103ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] LogicalOperator
src/stages/fsm/gesture-fsm.ts:442:9
 
     // State transition actions
     if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
-    if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
+    if (prev === 'ENGAGED' || next === 'ARMED') return 'UP';
     if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
     
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 37ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:443:53
     // State transition actions
     if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
     if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
-    if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
+    if ((prev === 'ARMED' || prev === 'ENGAGED') && next !== 'IDLE') return 'CANCEL';
     
     // Movement actions
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 161ms

 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 50ms

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:443:53
     // State transition actions
     if (prev === 'ARMED' && next === 'ENGAGED') return 'DOWN';
     if (prev === 'ENGAGED' && next === 'ARMED') return 'UP';
-    if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
+    if ((prev === 'ARMED' || prev === 'ENGAGED') && true) return 'CANCEL';
     
     // Movement actions
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:446:9
     if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
     
     // Movement actions
-    if (next === 'ARMED' || next === 'ENGAGED') return 'MOVE';
+    if (false || next === 'ENGAGED') return 'MOVE';
     
     return 'NONE';
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:446:9
     if ((prev === 'ARMED' || prev === 'ENGAGED') && next === 'IDLE') return 'CANCEL';
     
     // Movement actions
-    if (next === 'ARMED' || next === 'ENGAGED') return 'MOVE';
+    if (false) return 'MOVE';
     
     return 'NONE';
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/testing/integration.test.ts > Integration Tests > Frame Drop → Coast → Snap-Lock Sequence > should coast during tracking loss and snap-lock on resume
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:454:24
   /**
    * Get current state
    */
-  getState(): FSMState {
-    const snapshot = this.actor.getSnapshot();
-    const value = snapshot.value as string;
-    
-    // Map internal states to external states
-    if (value === 'ARMED_DWELL') return 'IDLE';
-    if (value === 'ENGAGED_DWELL') return 'ARMED';
-    return value as FSMState;
-  }
+  getState(): FSMState {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX


 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 75ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:459:9
     const value = snapshot.value as string;
     
     // Map internal states to external states
-    if (value === 'ARMED_DWELL') return 'IDLE';
+    if (true) return 'IDLE';
     if (value === 'ENGAGED_DWELL') return 'ARMED';
     return value as FSMState;
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/testing/integration.test.ts > Integration Tests > Frame Drop → Coast → Snap-Lock Sequence > should coast during tracking loss and snap-lock on resume
using deprecated parameters for the initialization function; pass a single object instead

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:459:9
     const value = snapshot.value as string;
     
     // Map internal states to external states
-    if (value === 'ARMED_DWELL') return 'IDLE';
+    if (value !== 'ARMED_DWELL') return 'IDLE';
     if (value === 'ENGAGED_DWELL') return 'ARMED';
     return value as FSMState;
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 73ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 40ms

[Killed] EqualityOperator
src/stages/fsm/gesture-fsm.ts:460:9
     
     // Map internal states to external states
     if (value === 'ARMED_DWELL') return 'IDLE';
-    if (value === 'ENGAGED_DWELL') return 'ARMED';
+    if (value !== 'ENGAGED_DWELL') return 'ARMED';
     return value as FSMState;
   }
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 37ms

 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 204ms

[Killed] ConditionalExpression
src/stages/fsm/gesture-fsm.ts:460:9
     
     // Map internal states to external states
     if (value === 'ARMED_DWELL') return 'IDLE';
-    if (value === 'ENGAGED_DWELL') return 'ARMED';
+    if (false) return 'ARMED';
     return value as FSMState;
   }
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/emitter/pointer-event-factory.test.ts (24 tests) 56ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 43ms

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:467:30
   /**
    * Get raw internal state (for debugging)
    */
-  getInternalState(): string {
-    return this.actor.getSnapshot().value as string;
-  }
+  getInternalState(): string {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:474:35
   /**
    * Get context
    */
-  getContext(): GestureFSMContext {
-    return this.actor.getSnapshot().context;
-  }
+  getContext(): GestureFSMContext {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:481:17
   /**
    * Reset FSM to IDLE
    */
-  reset(): void {
-    this.actor.stop();
-    this.actor = createActor(this.machine);
-    this.actor.start();
-    this.previousState = 'IDLE';
-  }
+  reset(): void {}
 
   /**
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 36ms

stderr | src/stages/physics/physics-cursor.test.ts > PhysicsCursor > Unit Tests > should initialize at center position
using deprecated parameters for the initialization function; pass a single object instead

[Killed] BlockStatement
src/stages/fsm/gesture-fsm.ts:491:52
   /**
    * Update configuration (requires reset)
    */
-  configure(config: Partial<FSMStageConfig>): void {
-    this.config = FSMStageConfigSchema.parse({ ...this.config, ...config });
-    this.machine = createGestureMachine(this.config);
-    this.reset();
-  }
+  configure(config: Partial<FSMStageConfig>): void {}
 }
 
killedBy: All tests
statusReason: RUN  v2.1.9 C:/Dev/active/hfo_gen88/hot_obsidian_sandbox/bronze/P0_GESTURE_MONOLITH/.stryker-tmp/sandbox-oiZNaX



 ✓ src/stages/physics/one-euro-filter.test.ts (15 tests) 180ms

 ✓ src/stages/fsm/palm-cone.test.ts (8 tests) 42ms
