[Killed] MethodExpression
psychic_scream.ts:28:9
 
 export const CacaoPlaybookSchema = z.object({
     type: z.literal('playbook'),
-    id: z.string().startsWith('playbook--'),
+    id: z.string().endsWith('playbook--'),
     name: z.string(),
     description: z.string(),
killedBy: Psychic Scream (Negative Trust Protocol) Zod Schemas should kill CacaoStepSchema and PlaybookSchema mutants
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
psychic_scream.ts:44:40
     cacao_playbook: CacaoPlaybookSchema.optional(),
 }).passthrough();
 
-export const ManifestSchema = z.object({
-    identity: z.object({
-        port: z.number(),
-        commander: z.string(),
-    }).passthrough(),
-    galois_lattice: z.object({
-        coordinate: z.array(z.number()).length(2),
-    }).passthrough(),
-    dna: z.object({
-        hfo_generation: z.number(),
-    }).passthrough(),
-}).passthrough();
+export const ManifestSchema = z.object({}).passthrough();
 
 const __filename = fileURLToPath(import.meta.url);
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect schema violations
statusReason: expected undefined not to be undefined

[Killed] ObjectLiteral
psychic_scream.ts:49:30
         port: z.number(),
         commander: z.string(),
     }).passthrough(),
-    galois_lattice: z.object({
-        coordinate: z.array(z.number()).length(2),
-    }).passthrough(),
+    galois_lattice: z.object({}).passthrough(),
     dna: z.object({
         hfo_generation: z.number(),
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should handle malformed JSON
statusReason: ENOENT: no such file or directory, unlink 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\malformed.json'

[Killed] StringLiteral
psychic_scream.ts:61:37
 const __dirname = path.dirname(__filename);
 
 const ROOT_DIR = path.resolve(__dirname, '../../../');
-const HOT_DIR = path.join(ROOT_DIR, 'hot_obsidian_sandbox');
+const HOT_DIR = path.join(ROOT_DIR, "");
 const BLACKBOARD_PATH = path.resolve(ROOT_DIR, 'obsidianblackboard.jsonl');
 const MUTATION_REPORT_PATH = path.join(HOT_DIR, 'bronze/infra/reports/mutation/mutation.json');
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\temp_blackboard.jsonl'

[Survived] StringLiteral
psychic_scream.ts:62:48
 
 const ROOT_DIR = path.resolve(__dirname, '../../../');
 const HOT_DIR = path.join(ROOT_DIR, 'hot_obsidian_sandbox');
-const BLACKBOARD_PATH = path.resolve(ROOT_DIR, 'obsidianblackboard.jsonl');
+const BLACKBOARD_PATH = path.resolve(ROOT_DIR, "");
 const MUTATION_REPORT_PATH = path.join(HOT_DIR, 'bronze/infra/reports/mutation/mutation.json');
 

[Killed] ArrayDeclaration
psychic_scream.ts:65:28
 const BLACKBOARD_PATH = path.resolve(ROOT_DIR, 'obsidianblackboard.jsonl');
 const MUTATION_REPORT_PATH = path.join(HOT_DIR, 'bronze/infra/reports/mutation/mutation.json');
 
-const ALLOWED_ROOT_FILES = [
-    'hot_obsidian_sandbox',
-    'cold_obsidian_sandbox',
-    'AGENTS.md',
-    'llms.txt',
-    'obsidianblackboard.jsonl',
-    'package.json',
-    'package-lock.json',
-    'stryker.root.config.mjs',
-    'vitest.root.config.ts',
-    '.git',
-    '.gitignore',
-    '.vscode',
-    '.env',
-    '.stryker-tmp',
-    'node_modules'
-];
+const ALLOWED_ROOT_FILES = [];
 
 const ALLOWED_ROOT_PATTERNS = [
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow all files in the allowed list
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(12) ] to have a length of +0 but got 15

[Killed] StringLiteral
psychic_scream.ts:66:5
 const MUTATION_REPORT_PATH = path.join(HOT_DIR, 'bronze/infra/reports/mutation/mutation.json');
 
 const ALLOWED_ROOT_FILES = [
-    'hot_obsidian_sandbox',
+    "",
     'cold_obsidian_sandbox',
     'AGENTS.md',
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow all files in the allowed list
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] StringLiteral
psychic_scream.ts:69:5
     'hot_obsidian_sandbox',
     'cold_obsidian_sandbox',
     'AGENTS.md',
-    'llms.txt',
+    "",
     'obsidianblackboard.jsonl',
     'package.json',
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\temp_blackboard.jsonl'

[Killed] StringLiteral
psychic_scream.ts:70:5
     'cold_obsidian_sandbox',
     'AGENTS.md',
     'llms.txt',
-    'obsidianblackboard.jsonl',
+    "",
     'package.json',
     'package-lock.json',
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow all files in the allowed list
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] StringLiteral
psychic_scream.ts:73:5
     'obsidianblackboard.jsonl',
     'package.json',
     'package-lock.json',
-    'stryker.root.config.mjs',
+    "",
     'vitest.root.config.ts',
     '.git',
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow all files in the allowed list
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] StringLiteral
psychic_scream.ts:75:5
     'package-lock.json',
     'stryker.root.config.mjs',
     'vitest.root.config.ts',
-    '.git',
+    "",
     '.gitignore',
     '.vscode',
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\temp_blackboard.jsonl'

[Survived] Regex
psychic_scream.ts:84:5
 ];
 
 const ALLOWED_ROOT_PATTERNS = [
-    /^ttao-notes-.*\.md$/
+    /ttao-notes-.*\.md$/
 ];
 

[Killed] BlockStatement
psychic_scream.ts:95:35
 
 export const violations: Violation[] = [];
 
-export function clearViolations() {
-    violations.length = 0;
-}
+export function clearViolations() {}
 
 export function scream(v: Violation, blackboardPath?: string) {
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow all files in the allowed list
statusReason: expected [ { file: 'bad.exe', …(2) }, …(1) ] to have a length of +0 but got 2

[Killed] BlockStatement
psychic_scream.ts:99:63
     violations.length = 0;
 }
 
-export function scream(v: Violation, blackboardPath?: string) {
-    const targetPath = blackboardPath || BLACKBOARD_PATH;
-    console.error(`\n PSYCHIC SCREAM: [${v.type}] in ${v.file}`);
-    console.error(`   > ${v.message}`);
-    violations.push(v);
-    
-    // Log to Blackboard
-    const logEntry = {
-        ts: new Date().toISOString(),
-        type: 'SCREAM',
-        mark: 'PSYCHIC_SCREAM_VIOLATION',
-        file: v.file,
-        violationType: v.type,
-        msg: v.message,
-        hive: 'HFO_GEN88',
-        gen: 88,
-        port: 4
-    };
-    try {
-        fs.appendFileSync(targetPath, JSON.stringify(logEntry) + '\n');
-    } catch (e) {
-        // Ignore blackboard errors in tests
-    }
-}
+export function scream(v: Violation, blackboardPath?: string) {}
 
 // 1. Root Pollution Check
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
psychic_scream.ts:100:24
 }
 
 export function scream(v: Violation, blackboardPath?: string) {
-    const targetPath = blackboardPath || BLACKBOARD_PATH;
+    const targetPath = true;
     console.error(`\n PSYCHIC SCREAM: [${v.type}] in ${v.file}`);
     console.error(`   > ${v.message}`);
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\temp_blackboard.jsonl'

[Killed] ConditionalExpression
psychic_scream.ts:100:24
 }
 
 export function scream(v: Violation, blackboardPath?: string) {
-    const targetPath = blackboardPath || BLACKBOARD_PATH;
+    const targetPath = false;
     console.error(`\n PSYCHIC SCREAM: [${v.type}] in ${v.file}`);
     console.error(`   > ${v.message}`);
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\temp_blackboard.jsonl'

[Killed] StringLiteral
psychic_scream.ts:101:19
 
 export function scream(v: Violation, blackboardPath?: string) {
     const targetPath = blackboardPath || BLACKBOARD_PATH;
-    console.error(`\n PSYCHIC SCREAM: [${v.type}] in ${v.file}`);
+    console.error(``);
     console.error(`   > ${v.message}`);
     violations.push(v);
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st error call:

  Array [
-   StringContaining "[TEST_TYPE] in test.ts",

[Killed] StringLiteral
psychic_scream.ts:109:15
     const logEntry = {
         ts: new Date().toISOString(),
         type: 'SCREAM',
-        mark: 'PSYCHIC_SCREAM_VIOLATION',
+        mark: "",
         file: v.file,
         violationType: v.type,
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: expected '' to be 'PSYCHIC_SCREAM_VIOLATION' // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:117:9
         gen: 88,
         port: 4
     };
-    try {
-        fs.appendFileSync(targetPath, JSON.stringify(logEntry) + '\n');
-    } catch (e) {
+    try {} catch (e) {
         // Ignore blackboard errors in tests
     }
killedBy: Psychic Scream (Negative Trust Protocol) scream should log exact messages and verify blackboard content
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\P4_RED_REGNANT\.stryker-tmp\sandbox-sqKwBd\temp_blackboard.jsonl'

[Killed] BlockStatement
psychic_scream.ts:125:81
 }
 
 // 1. Root Pollution Check
-export function checkRootPollution(entries?: string[], blackboardPath?: string) {
-    const targetEntries = entries || fs.readdirSync(ROOT_DIR);
-    for (const entry of targetEntries) {
-        const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
-        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
-        
-        if (!isAllowedFile && !isAllowedPattern) {
-            scream({
-                file: entry,
-                type: 'POLLUTION',
-                message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
-            }, blackboardPath);
-        }
-    }
-}
+export function checkRootPollution(entries?: string[], blackboardPath?: string) {}
 
 // 2. Mutation Proof Check (80-99%)
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should detect root pollution with exact message
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:126:27
 
 // 1. Root Pollution Check
 export function checkRootPollution(entries?: string[], blackboardPath?: string) {
-    const targetEntries = entries || fs.readdirSync(ROOT_DIR);
+    const targetEntries = false;
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should detect root pollution with exact message
statusReason: targetEntries is not iterable

[Killed] LogicalOperator
psychic_scream.ts:126:27
 
 // 1. Root Pollution Check
 export function checkRootPollution(entries?: string[], blackboardPath?: string) {
-    const targetEntries = entries || fs.readdirSync(ROOT_DIR);
+    const targetEntries = entries && fs.readdirSync(ROOT_DIR);
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should detect root pollution with exact message
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:127:40
 // 1. Root Pollution Check
 export function checkRootPollution(entries?: string[], blackboardPath?: string) {
     const targetEntries = entries || fs.readdirSync(ROOT_DIR);
-    for (const entry of targetEntries) {
-        const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
-        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
-        
-        if (!isAllowedFile && !isAllowedPattern) {
-            scream({
-                file: entry,
-                type: 'POLLUTION',
-                message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
-            }, blackboardPath);
-        }
-    }
+    for (const entry of targetEntries) {}
 }
 
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should detect root pollution with exact message
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
psychic_scream.ts:129:61
     const targetEntries = entries || fs.readdirSync(ROOT_DIR);
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
-        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
+        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(() => undefined);
         
         if (!isAllowedFile && !isAllowedPattern) {
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow ttao-notes with regex
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Survived] MethodExpression
psychic_scream.ts:129:34
     const targetEntries = entries || fs.readdirSync(ROOT_DIR);
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
-        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
+        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.every(pattern => pattern.test(entry));
         
         if (!isAllowedFile && !isAllowedPattern) {

[Killed] LogicalOperator
psychic_scream.ts:131:13
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
         const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
         
-        if (!isAllowedFile && !isAllowedPattern) {
+        if (!isAllowedFile || !isAllowedPattern) {
             scream({
                 file: entry,
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should allow all files in the allowed list
statusReason: expected [ { …(3) }, { …(3) }, { …(3) }, …(12) ] to have a length of +0 but got 15

[Killed] ConditionalExpression
psychic_scream.ts:131:13
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
         const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
         
-        if (!isAllowedFile && !isAllowedPattern) {
+        if (false) {
             scream({
                 file: entry,
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should detect root pollution with exact message
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
psychic_scream.ts:134:23
         if (!isAllowedFile && !isAllowedPattern) {
             scream({
                 file: entry,
-                type: 'POLLUTION',
+                type: "",
                 message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
             }, blackboardPath);
killedBy: Psychic Scream (Negative Trust Protocol) checkRootPollution should detect root pollution with exact message
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
psychic_scream.ts:143:9
 
 // 2. Mutation Proof Check (80-99%)
 export function checkMutationProof(reportPath: string = MUTATION_REPORT_PATH, blackboardPath?: string) {
-    if (!fs.existsSync(reportPath)) {
+    if (fs.existsSync(reportPath)) {
         console.warn(` WARNING: Mutation report missing at ${reportPath}. Skipping mutation check.`);
         return;
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should handle missing report with warning
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 



Number of calls: 0

[Killed] BlockStatement
psychic_scream.ts:143:37
 
 // 2. Mutation Proof Check (80-99%)
 export function checkMutationProof(reportPath: string = MUTATION_REPORT_PATH, blackboardPath?: string) {
-    if (!fs.existsSync(reportPath)) {
-        console.warn(` WARNING: Mutation report missing at ${reportPath}. Skipping mutation check.`);
-        return;
-    }
+    if (!fs.existsSync(reportPath)) {}
 
     try {
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should handle missing report with warning
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 



Number of calls: 0

[Survived] StringLiteral
psychic_scream.ts:149:63
     }
 
     try {
-        const report = JSON.parse(fs.readFileSync(reportPath, 'utf8'));
+        const report = JSON.parse(fs.readFileSync(reportPath, ""));
         const files = report.files || {};
 

[Killed] LogicalOperator
psychic_scream.ts:150:23
 
     try {
         const report = JSON.parse(fs.readFileSync(reportPath, 'utf8'));
-        const files = report.files || {};
+        const files = report.files && {};
 
         for (const [filePath, data] of Object.entries(files)) {
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected undefined to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:150:23
 
     try {
         const report = JSON.parse(fs.readFileSync(reportPath, 'utf8'));
-        const files = report.files || {};
+        const files = false;
 
         for (const [filePath, data] of Object.entries(files)) {
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected undefined to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:152:63
         const report = JSON.parse(fs.readFileSync(reportPath, 'utf8'));
         const files = report.files || {};
 
-        for (const [filePath, data] of Object.entries(files)) {
-            const mutants = (data as any).mutants || [];
-            const total = mutants.length;
-            if (total === 0) continue;
-
-            const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
-            const score = (killed / total) * 100;
-
-            if (score < 80) {
-                scream({
-                    file: filePath,
-                    type: 'MUTATION_FAILURE',
-                    message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
-                }, blackboardPath);
-            } else if (score >= 100) {
-                scream({
-                    file: filePath,
-                    type: 'THEATER',
-                    message: `Mutation score 100% detected. This is "Theater" and is forbidden.`
-                }, blackboardPath);
-            }
-        }
+        for (const [filePath, data] of Object.entries(files)) {}
     } catch (err) {
         console.error(' Failed to parse mutation report:', err);
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected undefined to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:153:29
         const files = report.files || {};
 
         for (const [filePath, data] of Object.entries(files)) {
-            const mutants = (data as any).mutants || [];
+            const mutants = false;
             const total = mutants.length;
             if (total === 0) continue;
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should handle missing mutants array in report
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] LogicalOperator
psychic_scream.ts:153:29
         const files = report.files || {};
 
         for (const [filePath, data] of Object.entries(files)) {
-            const mutants = (data as any).mutants || [];
+            const mutants = (data as any).mutants && [];
             const total = mutants.length;
             if (total === 0) continue;
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should handle missing mutants array in report
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
psychic_scream.ts:155:17
         for (const [filePath, data] of Object.entries(files)) {
             const mutants = (data as any).mutants || [];
             const total = mutants.length;
-            if (total === 0) continue;
+            if (true) continue;
 
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected undefined to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] EqualityOperator
psychic_scream.ts:155:17
         for (const [filePath, data] of Object.entries(files)) {
             const mutants = (data as any).mutants || [];
             const total = mutants.length;
-            if (total === 0) continue;
+            if (total !== 0) continue;
 
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected undefined to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:157:55
             const total = mutants.length;
             if (total === 0) continue;
 
-            const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
+            const killed = mutants.filter((m: any) => true).length;
             const score = (killed / total) * 100;
 
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected 'Mutation score 100% detected. This is…' to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] EqualityOperator
psychic_scream.ts:157:55
             const total = mutants.length;
             if (total === 0) continue;
 
-            const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
+            const killed = mutants.filter((m: any) => m.status !== 'Killed' || m.status === 'Timeout').length;
             const score = (killed / total) * 100;
 
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect theater with exact message
statusReason: expected 'MUTATION_FAILURE' to be 'THEATER' // Object.is equality

[Killed] ArithmeticOperator
psychic_scream.ts:158:28
             if (total === 0) continue;
 
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
-            const score = (killed / total) * 100;
+            const score = (killed * total) * 100;
 
             if (score < 80) {
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected 'Mutation score 100% detected. This is…' to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] ArithmeticOperator
psychic_scream.ts:158:27
             if (total === 0) continue;
 
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
-            const score = (killed / total) * 100;
+            const score = killed / total / 100;
 
             if (score < 80) {
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected 'Mutation score 0.01% is below the 80%…' to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] EqualityOperator
psychic_scream.ts:160:17
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
             const score = (killed / total) * 100;
 
-            if (score < 80) {
+            if (score >= 80) {
                 scream({
                     file: filePath,
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect mutation failure with exact message
statusReason: expected undefined to be 'Mutation score 50.00% is below the 80…' // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:160:17
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
             const score = (killed / total) * 100;
 
-            if (score < 80) {
+            if (true) {
                 scream({
                     file: filePath,
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect theater with exact message
statusReason: expected 'MUTATION_FAILURE' to be 'THEATER' // Object.is equality

[Killed] EqualityOperator
psychic_scream.ts:166:24
                     type: 'MUTATION_FAILURE',
                     message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
                 }, blackboardPath);
-            } else if (score >= 100) {
+            } else if (score < 100) {
                 scream({
                     file: filePath,
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect theater with exact message
statusReason: expected undefined to be 'THEATER' // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:166:24
                     type: 'MUTATION_FAILURE',
                     message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
                 }, blackboardPath);
-            } else if (score >= 100) {
+            } else if (false) {
                 scream({
                     file: filePath,
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect theater with exact message
statusReason: expected undefined to be 'THEATER' // Object.is equality

[Killed] ObjectLiteral
psychic_scream.ts:167:24
                     message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
                 }, blackboardPath);
             } else if (score >= 100) {
-                scream({
-                    file: filePath,
-                    type: 'THEATER',
-                    message: `Mutation score 100% detected. This is "Theater" and is forbidden.`
-                }, blackboardPath);
+                scream({}, blackboardPath);
             }
         }
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect theater with exact message
statusReason: expected undefined to be 'THEATER' // Object.is equality

[Killed] StringLiteral
psychic_scream.ts:169:27
             } else if (score >= 100) {
                 scream({
                     file: filePath,
-                    type: 'THEATER',
+                    type: "",
                     message: `Mutation score 100% detected. This is "Theater" and is forbidden.`
                 }, blackboardPath);
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should detect theater with exact message
statusReason: expected '' to be 'THEATER' // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:174:19
                 }, blackboardPath);
             }
         }
-    } catch (err) {
-        console.error(' Failed to parse mutation report:', err);
-        scream({
-            file: reportPath,
-            type: 'MUTATION_FAILURE',
-            message: `Failed to parse mutation report: ${err}`
-        }, blackboardPath);
-    }
+    } catch (err) {}
 }
 
killedBy: Psychic Scream (Negative Trust Protocol) checkMutationProof should handle malformed JSON
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
psychic_scream.ts:189:9
     const relativePath = path.relative(ROOT_DIR, filePath);
 
     // Amnesia: Debug logs in Silver/Gold
-    if (content.includes('console.log(') || content.includes('console.debug(')) {
+    if (content.includes('console.log(') && content.includes('console.debug(')) {
         scream({
             file: relativePath,
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected false to be true // Object.is equality
