[Killed] ConditionalExpression
psychic_scream.ts:189:9
     const relativePath = path.relative(ROOT_DIR, filePath);
 
     // Amnesia: Debug logs in Silver/Gold
-    if (content.includes('console.log(') || content.includes('console.debug(')) {
+    if (true) {
         scream({
             file: relativePath,
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
psychic_scream.ts:193:22
         scream({
             file: relativePath,
             type: 'AMNESIA',
-            message: `Debug logs detected in Silver/Gold artifact. This is "Theater" masquerading as "Truth".`
+            message: ``
         }, blackboardPath);
     }
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected false to be true // Object.is equality

[Survived] Regex
psychic_scream.ts:198:38
     }
 
     // Bespoke: 'any' or 'unknown' without justification
-    const anyMatches = content.match(/:\s*any/g);
+    const anyMatches = content.match(/:\sany/g);
     if (anyMatches && !content.includes('// @bespoke')) {
         scream({

[Killed] BooleanLiteral
psychic_scream.ts:199:23
 
     // Bespoke: 'any' or 'unknown' without justification
     const anyMatches = content.match(/:\s*any/g);
-    if (anyMatches && !content.includes('// @bespoke')) {
+    if (anyMatches && content.includes('// @bespoke')) {
         scream({
             file: relativePath,
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:199:57
 
     // Bespoke: 'any' or 'unknown' without justification
     const anyMatches = content.match(/:\s*any/g);
-    if (anyMatches && !content.includes('// @bespoke')) {
-        scream({
-            file: relativePath,
-            type: 'BESPOKE',
-            message: `Bespoke 'any' type detected without // @bespoke justification.`
-        }, blackboardPath);
-    }
+    if (anyMatches && !content.includes('// @bespoke')) {}
 
     // Provenance: Silver files must have a provenance header
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
psychic_scream.ts:200:16
     // Bespoke: 'any' or 'unknown' without justification
     const anyMatches = content.match(/:\s*any/g);
     if (anyMatches && !content.includes('// @bespoke')) {
-        scream({
-            file: relativePath,
-            type: 'BESPOKE',
-            message: `Bespoke 'any' type detected without // @bespoke justification.`
-        }, blackboardPath);
+        scream({}, blackboardPath);
     }
 
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
psychic_scream.ts:202:19
     if (anyMatches && !content.includes('// @bespoke')) {
         scream({
             file: relativePath,
-            type: 'BESPOKE',
+            type: "",
             message: `Bespoke 'any' type detected without // @bespoke justification.`
         }, blackboardPath);
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect amnesia and bespoke types
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:208:74
     }
 
     // Provenance: Silver files must have a provenance header
-    if (filePath.includes('silver') && !content.includes('Provenance:')) {
-        scream({
-            file: relativePath,
-            type: 'VIOLATION',
-            message: `Silver artifact missing provenance header. Provenance is mandatory for promotion.`
-        }, blackboardPath);
-    }
+    if (filePath.includes('silver') && !content.includes('Provenance:')) {}
 }
 
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect missing provenance in silver
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
psychic_scream.ts:208:9
     }
 
     // Provenance: Silver files must have a provenance header
-    if (filePath.includes('silver') && !content.includes('Provenance:')) {
+    if (filePath.includes('silver') || !content.includes('Provenance:')) {
         scream({
             file: relativePath,
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should ignore .d.ts files
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] StringLiteral
psychic_scream.ts:211:19
     if (filePath.includes('silver') && !content.includes('Provenance:')) {
         scream({
             file: relativePath,
-            type: 'VIOLATION',
+            type: "",
             message: `Silver artifact missing provenance header. Provenance is mandatory for promotion.`
         }, blackboardPath);
killedBy: Psychic Scream (Negative Trust Protocol) auditContent should detect missing provenance in silver
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
psychic_scream.ts:219:24
 
 // 4. Silver/Gold Integrity Scan
 export function scanMedallions(medallionPaths?: string[], blackboardPath?: string) {
-    const medallions = medallionPaths || [path.join(HOT_DIR, 'silver'), path.join(HOT_DIR, 'gold')];
+    const medallions = medallionPaths && [path.join(HOT_DIR, 'silver'), path.join(HOT_DIR, 'gold')];
     
     for (const dir of medallions) {
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
psychic_scream.ts:219:24
 
 // 4. Silver/Gold Integrity Scan
 export function scanMedallions(medallionPaths?: string[], blackboardPath?: string) {
-    const medallions = medallionPaths || [path.join(HOT_DIR, 'silver'), path.join(HOT_DIR, 'gold')];
+    const medallions = true;
     
     for (const dir of medallions) {
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: medallions is not iterable

[Killed] BlockStatement
psychic_scream.ts:221:35
 export function scanMedallions(medallionPaths?: string[], blackboardPath?: string) {
     const medallions = medallionPaths || [path.join(HOT_DIR, 'silver'), path.join(HOT_DIR, 'gold')];
     
-    for (const dir of medallions) {
-        if (!fs.existsSync(dir)) continue;
-        
-        const files = fs.readdirSync(dir, { recursive: true });
-        for (const file of files) {
-            const filePath = path.join(dir, file as string);
-            if (fs.statSync(filePath).isDirectory()) continue;
-
-            const content = fs.readFileSync(filePath, 'utf8');
-            auditContent(filePath, content, blackboardPath);
-
-            // Anti-Theater: Missing tests
-            if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
-                const testPath = filePath.replace(/\.ts$/, '.test.ts');
-                if (!fs.existsSync(testPath)) {
-                    scream({
-                        file: path.relative(ROOT_DIR, filePath),
-                        type: 'THEATER',
-                        message: `Silver/Gold artifact missing corresponding test file.`
-                    }, blackboardPath);
-                }
-            }
-        }
-    }
+    for (const dir of medallions) {}
 }
 
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] BooleanLiteral
psychic_scream.ts:222:13
     const medallions = medallionPaths || [path.join(HOT_DIR, 'silver'), path.join(HOT_DIR, 'gold')];
     
     for (const dir of medallions) {
-        if (!fs.existsSync(dir)) continue;
+        if (fs.existsSync(dir)) continue;
         
         const files = fs.readdirSync(dir, { recursive: true });
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
psychic_scream.ts:222:13
     const medallions = medallionPaths || [path.join(HOT_DIR, 'silver'), path.join(HOT_DIR, 'gold')];
     
     for (const dir of medallions) {
-        if (!fs.existsSync(dir)) continue;
+        if (false) continue;
         
         const files = fs.readdirSync(dir, { recursive: true });
killedBy: Psychic Scream (Negative Trust Protocol) main should exit 1 on failure
statusReason: ENOENT: no such file or directory, scandir 'C:\Dev\active\hfo_gen88\hot_obsidian_sandbox\bronze\hot_obsidian_sandbox\gold'

[Killed] BooleanLiteral
psychic_scream.ts:224:56
     for (const dir of medallions) {
         if (!fs.existsSync(dir)) continue;
         
-        const files = fs.readdirSync(dir, { recursive: true });
+        const files = fs.readdirSync(dir, { recursive: false });
         for (const file of files) {
             const filePath = path.join(dir, file as string);
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
psychic_scream.ts:225:35
         if (!fs.existsSync(dir)) continue;
         
         const files = fs.readdirSync(dir, { recursive: true });
-        for (const file of files) {
-            const filePath = path.join(dir, file as string);
-            if (fs.statSync(filePath).isDirectory()) continue;
-
-            const content = fs.readFileSync(filePath, 'utf8');
-            auditContent(filePath, content, blackboardPath);
-
-            // Anti-Theater: Missing tests
-            if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
-                const testPath = filePath.replace(/\.ts$/, '.test.ts');
-                if (!fs.existsSync(testPath)) {
-                    scream({
-                        file: path.relative(ROOT_DIR, filePath),
-                        type: 'THEATER',
-                        message: `Silver/Gold artifact missing corresponding test file.`
-                    }, blackboardPath);
-                }
-            }
-        }
+        for (const file of files) {}
     }
 }
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
psychic_scream.ts:227:17
         const files = fs.readdirSync(dir, { recursive: true });
         for (const file of files) {
             const filePath = path.join(dir, file as string);
-            if (fs.statSync(filePath).isDirectory()) continue;
+            if (false) continue;
 
             const content = fs.readFileSync(filePath, 'utf8');
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: EISDIR: illegal operation on a directory, read

[Killed] ConditionalExpression
psychic_scream.ts:227:17
         const files = fs.readdirSync(dir, { recursive: true });
         for (const file of files) {
             const filePath = path.join(dir, file as string);
-            if (fs.statSync(filePath).isDirectory()) continue;
+            if (true) continue;
 
             const content = fs.readFileSync(filePath, 'utf8');
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] BooleanLiteral
psychic_scream.ts:233:45
             auditContent(filePath, content, blackboardPath);
 
             // Anti-Theater: Missing tests
-            if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
+            if (filePath.endsWith('.ts') && filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
                 const testPath = filePath.replace(/\.ts$/, '.test.ts');
                 if (!fs.existsSync(testPath)) {
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] MethodExpression
psychic_scream.ts:233:80
             auditContent(filePath, content, blackboardPath);
 
             // Anti-Theater: Missing tests
-            if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
+            if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.startsWith('.d.ts')) {
                 const testPath = filePath.replace(/\.ts$/, '.test.ts');
                 if (!fs.existsSync(testPath)) {
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should ignore .d.ts files
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Survived] Regex
psychic_scream.ts:234:51
 
             // Anti-Theater: Missing tests
             if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
-                const testPath = filePath.replace(/\.ts$/, '.test.ts');
+                const testPath = filePath.replace(/\.ts/, '.test.ts');
                 if (!fs.existsSync(testPath)) {
                     scream({

[Killed] ConditionalExpression
psychic_scream.ts:235:21
             // Anti-Theater: Missing tests
             if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
                 const testPath = filePath.replace(/\.ts$/, '.test.ts');
-                if (!fs.existsSync(testPath)) {
+                if (false) {
                     scream({
                         file: path.relative(ROOT_DIR, filePath),
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
psychic_scream.ts:235:47
             // Anti-Theater: Missing tests
             if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts') && !filePath.endsWith('.d.ts')) {
                 const testPath = filePath.replace(/\.ts$/, '.test.ts');
-                if (!fs.existsSync(testPath)) {
-                    scream({
-                        file: path.relative(ROOT_DIR, filePath),
-                        type: 'THEATER',
-                        message: `Silver/Gold artifact missing corresponding test file.`
-                    }, blackboardPath);
-                }
+                if (!fs.existsSync(testPath)) {}
             }
         }
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] StringLiteral
psychic_scream.ts:238:31
                 if (!fs.existsSync(testPath)) {
                     scream({
                         file: path.relative(ROOT_DIR, filePath),
-                        type: 'THEATER',
+                        type: "",
                         message: `Silver/Gold artifact missing corresponding test file.`
                     }, blackboardPath);
killedBy: Psychic Scream (Negative Trust Protocol) scanMedallions should detect missing tests and handle existing ones
statusReason: expected undefined not to be undefined

[Killed] LogicalOperator
psychic_scream.ts:251:24
  * Validates the integrity of the Blood Book of Grudges (JSONL).
  */
 export function checkLedgerIntegrity(ledgerPath?: string, blackboardPath?: string) {
-    const targetPath = ledgerPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/BLOOD_BOOK_OF_GRUDGES.jsonl');
+    const targetPath = ledgerPath && path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/BLOOD_BOOK_OF_GRUDGES.jsonl');
     if (!fs.existsSync(targetPath)) {
         scream({
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:251:24
  * Validates the integrity of the Blood Book of Grudges (JSONL).
  */
 export function checkLedgerIntegrity(ledgerPath?: string, blackboardPath?: string) {
-    const targetPath = ledgerPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/BLOOD_BOOK_OF_GRUDGES.jsonl');
+    const targetPath = false;
     if (!fs.existsSync(targetPath)) {
         scream({
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:252:37
  */
 export function checkLedgerIntegrity(ledgerPath?: string, blackboardPath?: string) {
     const targetPath = ledgerPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/BLOOD_BOOK_OF_GRUDGES.jsonl');
-    if (!fs.existsSync(targetPath)) {
-        scream({
-            type: 'VIOLATION',
-            file: targetPath,
-            message: 'Blood Book of Grudges is missing. Port 4 requires a ledger.'
-        }, blackboardPath);
-        return;
-    }
+    if (!fs.existsSync(targetPath)) {}
 
     try {
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect missing ledger
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:252:9
  */
 export function checkLedgerIntegrity(ledgerPath?: string, blackboardPath?: string) {
     const targetPath = ledgerPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/BLOOD_BOOK_OF_GRUDGES.jsonl');
-    if (!fs.existsSync(targetPath)) {
+    if (true) {
         scream({
             type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
psychic_scream.ts:254:19
     const targetPath = ledgerPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/BLOOD_BOOK_OF_GRUDGES.jsonl');
     if (!fs.existsSync(targetPath)) {
         scream({
-            type: 'VIOLATION',
+            type: "",
             file: targetPath,
             message: 'Blood Book of Grudges is missing. Port 4 requires a ledger.'

[Killed] StringLiteral
psychic_scream.ts:256:22
         scream({
             type: 'VIOLATION',
             file: targetPath,
-            message: 'Blood Book of Grudges is missing. Port 4 requires a ledger.'
+            message: ""
         }, blackboardPath);
         return;
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect missing ledger
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
psychic_scream.ts:262:25
     }
 
     try {
-        const content = fs.readFileSync(targetPath, 'utf8').trim();
+        const content = fs.readFileSync(targetPath, 'utf8');
         if (!content) return;
         const lines = content.split('\n');

[Killed] BooleanLiteral
psychic_scream.ts:263:13
 
     try {
         const content = fs.readFileSync(targetPath, 'utf8').trim();
-        if (!content) return;
+        if (content) return;
         const lines = content.split('\n');
         let expectedPrevHash = '0000000000000000000000000000000000000000000000000000000000000000';
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:263:13
 
     try {
         const content = fs.readFileSync(targetPath, 'utf8').trim();
-        if (!content) return;
+        if (true) return;
         const lines = content.split('\n');
         let expectedPrevHash = '0000000000000000000000000000000000000000000000000000000000000000';
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:271:34
             const entry = JSON.parse(line);
             const result = BloodBookEntrySchema.safeParse(entry);
             
-            if (!result.success) {
-                scream({
-                    type: 'VIOLATION',
-                    file: targetPath,
-                    message: `Ledger entry ${i} failed schema validation.`
-                }, blackboardPath);
-            }
+            if (!result.success) {}
 
             if (entry.prev_hash !== expectedPrevHash) {
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect schema violations
statusReason: expected undefined not to be undefined

[Killed] StringLiteral
psychic_scream.ts:275:30
                 scream({
                     type: 'VIOLATION',
                     file: targetPath,
-                    message: `Ledger entry ${i} failed schema validation.`
+                    message: ``
                 }, blackboardPath);
             }
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect schema violations
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
psychic_scream.ts:279:17
                 }, blackboardPath);
             }
 
-            if (entry.prev_hash !== expectedPrevHash) {
+            if (false) {
                 scream({
                     type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:279:55
                 }, blackboardPath);
             }
 
-            if (entry.prev_hash !== expectedPrevHash) {
-                scream({
-                    type: 'VIOLATION',
-                    file: targetPath,
-                    message: `Ledger integrity chain broken at entry ${i}.`
-                }, blackboardPath);
-            }
+            if (entry.prev_hash !== expectedPrevHash) {}
 
             const entryForHashing = { ...entry };
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
psychic_scream.ts:280:24
             }
 
             if (entry.prev_hash !== expectedPrevHash) {
-                scream({
-                    type: 'VIOLATION',
-                    file: targetPath,
-                    message: `Ledger integrity chain broken at entry ${i}.`
-                }, blackboardPath);
+                scream({}, blackboardPath);
             }
 
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] StringLiteral
psychic_scream.ts:283:30
                 scream({
                     type: 'VIOLATION',
                     file: targetPath,
-                    message: `Ledger integrity chain broken at entry ${i}.`
+                    message: ``
                 }, blackboardPath);
             }
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch and chain breaks
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
psychic_scream.ts:287:37
                 }, blackboardPath);
             }
 
-            const entryForHashing = { ...entry };
+            const entryForHashing = {};
             delete entryForHashing.hash;
             const calculatedHash = crypto.createHash('sha256').update(JSON.stringify(entryForHashing)).digest('hex');

[Killed] ConditionalExpression
psychic_scream.ts:291:17
             delete entryForHashing.hash;
             const calculatedHash = crypto.createHash('sha256').update(JSON.stringify(entryForHashing)).digest('hex');
             
-            if (entry.hash !== calculatedHash) {
+            if (false) {
                 scream({
                     type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch when content is tampered
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
psychic_scream.ts:291:48
             delete entryForHashing.hash;
             const calculatedHash = crypto.createHash('sha256').update(JSON.stringify(entryForHashing)).digest('hex');
             
-            if (entry.hash !== calculatedHash) {
-                scream({
-                    type: 'VIOLATION',
-                    file: targetPath,
-                    message: `Ledger hash mismatch at entry ${i}.`
-                }, blackboardPath);
-            }
+            if (entry.hash !== calculatedHash) {}
 
             expectedPrevHash = entry.hash;
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch when content is tampered
statusReason: expected undefined not to be undefined

[Killed] ObjectLiteral
psychic_scream.ts:292:24
             const calculatedHash = crypto.createHash('sha256').update(JSON.stringify(entryForHashing)).digest('hex');
             
             if (entry.hash !== calculatedHash) {
-                scream({
-                    type: 'VIOLATION',
-                    file: targetPath,
-                    message: `Ledger hash mismatch at entry ${i}.`
-                }, blackboardPath);
+                scream({}, blackboardPath);
             }
 
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should detect hash mismatch when content is tampered
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
psychic_scream.ts:301:24
 
             expectedPrevHash = entry.hash;
         });
-    } catch (err: any) {
-        scream({
-            type: 'VIOLATION',
-            file: targetPath,
-            message: `Failed to process ledger: ${err.message}`
-        }, blackboardPath);
-    }
+    } catch (err: any) {}
 }
 
killedBy: Psychic Scream (Negative Trust Protocol) checkLedgerIntegrity should handle ledger processing errors
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
psychic_scream.ts:314:24
  * Validates the Red Regnant Manifest (YAML).
  */
 export function checkManifestIntegrity(manifestPath?: string, blackboardPath?: string) {
-    const targetPath = manifestPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/MANIFEST.yaml');
+    const targetPath = true;
     if (!fs.existsSync(targetPath)) {
         scream({
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect port mismatch
statusReason: expected undefined not to be undefined

[Killed] LogicalOperator
psychic_scream.ts:314:24
  * Validates the Red Regnant Manifest (YAML).
  */
 export function checkManifestIntegrity(manifestPath?: string, blackboardPath?: string) {
-    const targetPath = manifestPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/MANIFEST.yaml');
+    const targetPath = manifestPath && path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/MANIFEST.yaml');
     if (!fs.existsSync(targetPath)) {
         scream({
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect port mismatch
statusReason: expected undefined not to be undefined

[Killed] ConditionalExpression
psychic_scream.ts:315:9
  */
 export function checkManifestIntegrity(manifestPath?: string, blackboardPath?: string) {
     const targetPath = manifestPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/MANIFEST.yaml');
-    if (!fs.existsSync(targetPath)) {
+    if (false) {
         scream({
             type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect missing manifest
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
psychic_scream.ts:315:9
  */
 export function checkManifestIntegrity(manifestPath?: string, blackboardPath?: string) {
     const targetPath = manifestPath || path.join(HOT_DIR, 'bronze/P4_RED_REGNANT/MANIFEST.yaml');
-    if (!fs.existsSync(targetPath)) {
+    if (fs.existsSync(targetPath)) {
         scream({
             type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect missing manifest
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:324:9
         return;
     }
 
-    try {
-        const content = fs.readFileSync(targetPath, 'utf8');
-        const data = yaml.load(content);
-        const result = ManifestSchema.safeParse(data);
-
-        if (!result.success) {
-            scream({
-                type: 'VIOLATION',
-                file: targetPath,
-                message: 'Manifest failed schema validation.'
-            }, blackboardPath);
-        }
-
-        const manifestData = data as any;
-        if (manifestData.identity?.port !== 4) {
-            scream({
-                type: 'VIOLATION',
-                file: targetPath,
-                message: 'Manifest port mismatch. Expected Port 4.'
-            }, blackboardPath);
-        }
-    } catch (err: any) {
+    try {} catch (err: any) {
         scream({
             type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect port mismatch
statusReason: expected undefined not to be undefined
