[Survived] StringLiteral
psychic_scream.ts:325:53
     }
 
     try {
-        const content = fs.readFileSync(targetPath, 'utf8');
+        const content = fs.readFileSync(targetPath, "");
         const data = yaml.load(content);
         const result = ManifestSchema.safeParse(data);

[Killed] StringLiteral
psychic_scream.ts:333:26
             scream({
                 type: 'VIOLATION',
                 file: targetPath,
-                message: 'Manifest failed schema validation.'
+                message: ""
             }, blackboardPath);
         }
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect schema violations
statusReason: expected undefined not to be undefined

[Killed] EqualityOperator
psychic_scream.ts:338:13
         }
 
         const manifestData = data as any;
-        if (manifestData.identity?.port !== 4) {
+        if (manifestData.identity?.port === 4) {
             scream({
                 type: 'VIOLATION',
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect port mismatch
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
psychic_scream.ts:338:48
         }
 
         const manifestData = data as any;
-        if (manifestData.identity?.port !== 4) {
-            scream({
-                type: 'VIOLATION',
-                file: targetPath,
-                message: 'Manifest port mismatch. Expected Port 4.'
-            }, blackboardPath);
-        }
+        if (manifestData.identity?.port !== 4) {}
     } catch (err: any) {
         scream({
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect port mismatch
statusReason: expected undefined not to be undefined

[Killed] StringLiteral
psychic_scream.ts:342:26
             scream({
                 type: 'VIOLATION',
                 file: targetPath,
-                message: 'Manifest port mismatch. Expected Port 4.'
+                message: ""
             }, blackboardPath);
         }
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should detect port mismatch
statusReason: expected undefined not to be undefined

[Killed] BlockStatement
psychic_scream.ts:345:24
                 message: 'Manifest port mismatch. Expected Port 4.'
             }, blackboardPath);
         }
-    } catch (err: any) {
-        scream({
-            type: 'VIOLATION',
-            file: targetPath,
-            message: `Failed to process manifest: ${err.message}`
-        }, blackboardPath);
-    }
+    } catch (err: any) {}
 }
 
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should handle manifest processing errors
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
psychic_scream.ts:349:22
         scream({
             type: 'VIOLATION',
             file: targetPath,
-            message: `Failed to process manifest: ${err.message}`
+            message: ``
         }, blackboardPath);
     }
killedBy: Psychic Scream (Negative Trust Protocol) checkManifestIntegrity should handle manifest processing errors
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
psychic_scream.ts:358:24
 /**
  * Main execution entry point
  */
-export function main() {
-    console.log(' RED REGNANT: Initiating Psychic Scream (Negative Trust Mode)...');
-    checkRootPollution();
-    checkMutationProof();
-    scanMedallions();
-    checkLedgerIntegrity();
-    checkManifestIntegrity();
-
-    if (violations.length > 0) {
-        console.error(`\n SYSTEM COMPROMISED: ${violations.length} violations found.`);
-        process.exit(1);
-    } else {
-        console.log('\n CLEANROOM INTEGRITY VERIFIED. The Red Queen is satisfied.');
-        process.exit(0);
-    }
-}
+export function main() {}
 
 if (process.argv[1] === fileURLToPath(import.meta.url)) {
killedBy: Psychic Scream (Negative Trust Protocol) main should exit 1 on failure
statusReason: expected "spy" to be called with arguments: [ 1 ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
psychic_scream.ts:366:9
     checkLedgerIntegrity();
     checkManifestIntegrity();
 
-    if (violations.length > 0) {
+    if (false) {
         console.error(`\n SYSTEM COMPROMISED: ${violations.length} violations found.`);
         process.exit(1);
killedBy: Psychic Scream (Negative Trust Protocol) main should exit 1 on failure
statusReason: expected "spy" to be called with arguments: [ 1 ]

Received: 

  1st spy call:

  Array [
-   1,

[Killed] BlockStatement
psychic_scream.ts:366:32
     checkLedgerIntegrity();
     checkManifestIntegrity();
 
-    if (violations.length > 0) {
-        console.error(`\n SYSTEM COMPROMISED: ${violations.length} violations found.`);
-        process.exit(1);
-    } else {
+    if (violations.length > 0) {} else {
         console.log('\n CLEANROOM INTEGRITY VERIFIED. The Red Queen is satisfied.');
         process.exit(0);
killedBy: Psychic Scream (Negative Trust Protocol) main should exit 1 on failure
statusReason: expected "spy" to be called with arguments: [ 1 ]

Received: 



Number of calls: 0

[Survived] StringLiteral
psychic_scream.ts:367:23
     checkManifestIntegrity();
 
     if (violations.length > 0) {
-        console.error(`\n SYSTEM COMPROMISED: ${violations.length} violations found.`);
+        console.error(``);
         process.exit(1);
     } else {

[NoCoverage] BlockStatement
psychic_scream.ts:369:12
     if (violations.length > 0) {
         console.error(`\n SYSTEM COMPROMISED: ${violations.length} violations found.`);
         process.exit(1);
-    } else {
-        console.log('\n CLEANROOM INTEGRITY VERIFIED. The Red Queen is satisfied.');
-        process.exit(0);
-    }
+    } else {}
 }
 
