[Killed] BlockStatement
hot_obsidian_sandbox/silver/P1_WEB_WEAVER/bridger.ts:23:74
  * @param query The search query.
  * @returns Validated SearchResponse.
  */
-export async function fuseSearch(query: string): Promise<SearchResponse> {
-    const rawData = await search(query);
-    return VacuoleEnvelope(SearchResponseSchema, rawData);
-}
+export async function fuseSearch(query: string): Promise<SearchResponse> {}
 
 /**
killedBy: Port 1 Web Weaver should fuse search results into a validated envelope
statusReason: Cannot read properties of undefined (reading 'results')

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P1_WEB_WEAVER/bridger.ts:31:58
 /**
  * Bridge to Port 0 Search (Legacy/Direct).
  */
-export async function sense(query: string): Promise<any> {
-    return await search(query);
-}
+export async function sense(query: string): Promise<any> {}
 
killedBy: Port 1 Web Weaver should bridge to Port 0 search (RAW)
statusReason: Cannot read properties of undefined (reading 'results')
