[Survived] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:28:45
     description: z.string(),
 });
 
-export const CacaoPlaybookSchema = z.object({
-    type: z.literal('playbook'),
-    id: z.string().startsWith('playbook--'),
-    name: z.string(),
-    description: z.string(),
-    steps: z.array(CacaoStepSchema),
-});
+export const CacaoPlaybookSchema = z.object({});
 
 export const BloodBookEntrySchema = z.object({

[Survived] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:36:46
     steps: z.array(CacaoStepSchema),
 });
 
-export const BloodBookEntrySchema = z.object({
-    index: z.number(),
-    ts: z.string(),
-    artifact_id: z.string(),
-    resonance_signature: z.string(),
-    prev_hash: z.string(),
-    hash: z.string(),
-    cacao_playbook: CacaoPlaybookSchema.optional(),
-}).passthrough();
+export const BloodBookEntrySchema = z.object({}).passthrough();
 
 export const ManifestSchema = z.object({

[Killed] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:47:24
 }).passthrough();
 
 export const ManifestSchema = z.object({
-    identity: z.object({
-        port: z.number(),
-        commander: z.string(),
-    }).passthrough(),
+    identity: z.object({}).passthrough(),
     galois_lattice: z.object({
         coordinate: z.array(z.number()).length(2),
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\test_blackboard.jsonl'

[Survived] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:54:19
     galois_lattice: z.object({
         coordinate: z.array(z.number()).length(2),
     }).passthrough(),
-    dna: z.object({
-        hfo_generation: z.number(),
-    }).passthrough(),
+    dna: z.object({}).passthrough(),
 }).passthrough();
 

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:62:49
 const __filename = fileURLToPath(import.meta.url);
 const __dirname = path.dirname(__filename);
 
-export const ROOT_DIR = path.resolve(__dirname, '../../../');
+export const ROOT_DIR = path.resolve(__dirname, "");
 export const HOT_DIR = path.join(ROOT_DIR, 'hot_obsidian_sandbox');
 const BLACKBOARD_PATH = path.resolve(ROOT_DIR, 'obsidianblackboard.jsonl');

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:63:44
 const __dirname = path.dirname(__filename);
 
 export const ROOT_DIR = path.resolve(__dirname, '../../../');
-export const HOT_DIR = path.join(ROOT_DIR, 'hot_obsidian_sandbox');
+export const HOT_DIR = path.join(ROOT_DIR, "");
 const BLACKBOARD_PATH = path.resolve(ROOT_DIR, 'obsidianblackboard.jsonl');
 const MUTATION_REPORT_PATH = path.join(HOT_DIR, 'bronze/infra/reports/mutation/mutation.json');

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:65:49
 export const ROOT_DIR = path.resolve(__dirname, '../../../');
 export const HOT_DIR = path.join(ROOT_DIR, 'hot_obsidian_sandbox');
 const BLACKBOARD_PATH = path.resolve(ROOT_DIR, 'obsidianblackboard.jsonl');
-const MUTATION_REPORT_PATH = path.join(HOT_DIR, 'bronze/infra/reports/mutation/mutation.json');
+const MUTATION_REPORT_PATH = path.join(HOT_DIR, "");
 
 // --- GUARDS ---

[Survived] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:73:29
 const RECURSION_LIMIT = 5;
 
 // Mode detection
-export const IS_TEST_MODE = process.env.HFO_TEST_MODE === 'true';
+export const IS_TEST_MODE = false;
 
 const ALLOWED_ROOT_FILES = [

[Survived] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:73:29
 const RECURSION_LIMIT = 5;
 
 // Mode detection
-export const IS_TEST_MODE = process.env.HFO_TEST_MODE === 'true';
+export const IS_TEST_MODE = process.env.HFO_TEST_MODE !== 'true';
 
 const ALLOWED_ROOT_FILES = [

[Survived] ArrayDeclaration
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:75:28
 // Mode detection
 export const IS_TEST_MODE = process.env.HFO_TEST_MODE === 'true';
 
-const ALLOWED_ROOT_FILES = [
-    'hot_obsidian_sandbox',
-    'cold_obsidian_sandbox',
-    'AGENTS.md',
-    'llms.txt',
-    'obsidianblackboard.jsonl',
-    'package.json',
-    'package-lock.json',
-    'stryker.root.config.mjs',
-    'vitest.root.config.ts',
-    '.git',
-    '.gitignore',
-    '.vscode',
-    '.env',
-    '.kiro',
-    '.stryker-tmp',
-    '.husky',
-    'node_modules'
-];
+const ALLOWED_ROOT_FILES = [];
 
 const ALLOWED_ROOT_PATTERNS = [

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:81:5
     'AGENTS.md',
     'llms.txt',
     'obsidianblackboard.jsonl',
-    'package.json',
+    "",
     'package-lock.json',
     'stryker.root.config.mjs',

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:90:5
     '.vscode',
     '.env',
     '.kiro',
-    '.stryker-tmp',
+    "",
     '.husky',
     'node_modules'

[Killed] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:92:5
     '.kiro',
     '.stryker-tmp',
     '.husky',
-    'node_modules'
+    ""
 ];
 
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\test_blackboard.jsonl'

[Killed] ArrayDeclaration
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:95:31
     'node_modules'
 ];
 
-const ALLOWED_ROOT_PATTERNS = [
-    /^ttao-notes-.*\.md$/,
-    /^\.vitest-reside-.*$/,
-    /^vitest\..*$/
-];
+const ALLOWED_ROOT_PATTERNS = [];
 
 export interface Violation {
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should allow patterns
statusReason: expected [ Array(1) ] to have a length of +0 but got 1

[Survived] Regex
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:96:5
 ];
 
 const ALLOWED_ROOT_PATTERNS = [
-    /^ttao-notes-.*\.md$/,
+    /^ttao-notes-.*\.md/,
     /^\.vitest-reside-.*$/,
     /^vitest\..*$/

[Killed] Regex
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:97:5
 
 const ALLOWED_ROOT_PATTERNS = [
     /^ttao-notes-.*\.md$/,
-    /^\.vitest-reside-.*$/,
+    /^\.vitest-reside-.*/,
     /^vitest\..*$/
 ];
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\test_blackboard.jsonl'

[Survived] Regex
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:97:5
 
 const ALLOWED_ROOT_PATTERNS = [
     /^ttao-notes-.*\.md$/,
-    /^\.vitest-reside-.*$/,
+    /^\.vitest-reside-.$/,
     /^vitest\..*$/
 ];

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:114:9
 }
 
 export function scream(v: Violation, blackboardPath?: string) {
-    if (violations.length >= MAX_VIOLATIONS) {
+    if (false) {
         if (violations.length === MAX_VIOLATIONS) {
             console.error('\n 🛑 CIRCUIT BREAKER: Maximum violations reached. Screaming suppressed.');
killedBy: Physic Scream (Port 4 Gatekeeper) scream should trigger circuit breaker
statusReason: expected 60 to be 51 // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:114:9
 }
 
 export function scream(v: Violation, blackboardPath?: string) {
-    if (violations.length >= MAX_VIOLATIONS) {
+    if (violations.length < MAX_VIOLATIONS) {
         if (violations.length === MAX_VIOLATIONS) {
             console.error('\n 🛑 CIRCUIT BREAKER: Maximum violations reached. Screaming suppressed.');
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:115:51
 
 export function scream(v: Violation, blackboardPath?: string) {
     if (violations.length >= MAX_VIOLATIONS) {
-        if (violations.length === MAX_VIOLATIONS) {
-            console.error('\n 🛑 CIRCUIT BREAKER: Maximum violations reached. Screaming suppressed.');
-            violations.push({
-                file: 'SYSTEM',
-                type: 'VIOLATION',
-                message: 'Maximum violations reached.'
-            });
-        }
+        if (violations.length === MAX_VIOLATIONS) {}
         return;
     }
killedBy: Physic Scream (Port 4 Gatekeeper) scream should trigger circuit breaker
statusReason: expected 50 to be 51 // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:115:13
 
 export function scream(v: Violation, blackboardPath?: string) {
     if (violations.length >= MAX_VIOLATIONS) {
-        if (violations.length === MAX_VIOLATIONS) {
+        if (true) {
             console.error('\n 🛑 CIRCUIT BREAKER: Maximum violations reached. Screaming suppressed.');
             violations.push({
killedBy: Physic Scream (Port 4 Gatekeeper) scream should trigger circuit breaker
statusReason: expected 60 to be 51 // Object.is equality

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:116:27
 export function scream(v: Violation, blackboardPath?: string) {
     if (violations.length >= MAX_VIOLATIONS) {
         if (violations.length === MAX_VIOLATIONS) {
-            console.error('\n 🛑 CIRCUIT BREAKER: Maximum violations reached. Screaming suppressed.');
+            console.error("";
             violations.push({
                 file: 'SYSTEM',

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:126:24
         return;
     }
 
-    const targetPath = blackboardPath || BLACKBOARD_PATH;
+    const targetPath = false;
     console.error(`\n MUTATION SCREAM: [${v.type}] in ${v.file}`);
     console.error(`   > ${v.message}`);
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\test_blackboard.jsonl'

[Killed] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:126:24
         return;
     }
 
-    const targetPath = blackboardPath || BLACKBOARD_PATH;
+    const targetPath = blackboardPath && BLACKBOARD_PATH;
     console.error(`\n MUTATION SCREAM: [${v.type}] in ${v.file}`);
     console.error(`   > ${v.message}`);
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\test_blackboard.jsonl'

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:128:19
 
     const targetPath = blackboardPath || BLACKBOARD_PATH;
     console.error(`\n MUTATION SCREAM: [${v.type}] in ${v.file}`);
-    console.error(`   > ${v.message}`);
+    console.error(``);
     violations.push(v);
 

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:133:15
 
     const logEntry = {
         ts: new Date().toISOString(),
-        type: 'SCREAM',
+        type: "",
         mark: 'MUTATION_SCREAM_VIOLATION',
         file: v.file,

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:134:15
     const logEntry = {
         ts: new Date().toISOString(),
         type: 'SCREAM',
-        mark: 'MUTATION_SCREAM_VIOLATION',
+        mark: "",
         file: v.file,
         violationType: v.type,

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:138:15
         file: v.file,
         violationType: v.type,
         msg: v.message,
-        hive: 'HFO_GEN88',
+        hive: "",
         gen: 88,
         port: 4

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:143:9
         port: 4
     };
 
-    try {
-        fs.appendFileSync(targetPath, JSON.stringify(logEntry) + '\n');
-    } catch (e) {
+    try {} catch (e) {
         // Ignore blackboard errors in tests
     }
killedBy: Physic Scream (Port 4 Gatekeeper) scream should log to blackboard
statusReason: ENOENT: no such file or directory, open 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\test_blackboard.jsonl'

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:152:46
 
 export function demote(filePath: string, reason: string, blackboardPath?: string) {
     const relativePath = path.relative(ROOT_DIR, filePath);
-    const quarantineDir = path.join(HOT_DIR, 'bronze/quarantine', path.dirname(relativePath));
+    const quarantineDir = path.join(HOT_DIR, "", path.dirname(relativePath));
     const targetPath = path.join(quarantineDir, path.basename(filePath));
 

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:155:19
     const quarantineDir = path.join(HOT_DIR, 'bronze/quarantine', path.dirname(relativePath));
     const targetPath = path.join(quarantineDir, path.basename(filePath));
 
-    console.error(`\n 🚨 DEMOTING: ${relativePath}`);
+    console.error(``;
     console.error(`   > Reason: ${reason}`);
 

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:158:9
     console.error(`\n 🚨 DEMOTING: ${relativePath}`);
     console.error(`   > Reason: ${reason}`);
 
-    if (!fs.existsSync(quarantineDir)) {
+    if (false) {
         fs.mkdirSync(quarantineDir, { recursive: true });
     }

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:158:9
     console.error(`\n 🚨 DEMOTING: ${relativePath}`);
     console.error(`   > Reason: ${reason}`);
 
-    if (!fs.existsSync(quarantineDir)) {
+    if (true) {
         fs.mkdirSync(quarantineDir, { recursive: true });
     }

[NoCoverage] BooleanLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:159:50
     console.error(`   > Reason: ${reason}`);
 
     if (!fs.existsSync(quarantineDir)) {
-        fs.mkdirSync(quarantineDir, { recursive: true });
+        fs.mkdirSync(quarantineDir, { recursive: false });
     }
 

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:162:9
         fs.mkdirSync(quarantineDir, { recursive: true });
     }
 
-    try {
-        fs.renameSync(filePath, targetPath);
-
-        // Also demote test file if it exists
-        if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts')) {
-            const testPath = filePath.replace(/\.ts$/, '.test.ts');
-            if (fs.existsSync(testPath)) {
-                const testTarget = path.join(quarantineDir, path.basename(testPath));
-                fs.renameSync(testPath, testTarget);
-            }
-        }
-
-        const logEntry = {
-            ts: new Date().toISOString(),
-            type: 'DEMOTION',
-            mark: 'RED_REGNANT_DEMOTION',
-            file: relativePath,
-            reason: reason,
-            target: path.relative(ROOT_DIR, targetPath),
-            hive: 'HFO_GEN88',
-            gen: 88,
-            port: 4
-        };
-        fs.appendFileSync(blackboardPath || BLACKBOARD_PATH, JSON.stringify(logEntry) + '\n');
-    } catch (err) {
+    try {} catch (err) {
         console.error(`   > Failed to demote: ${err}`);
     }

[NoCoverage] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:166:13
         fs.renameSync(filePath, targetPath);
 
         // Also demote test file if it exists
-        if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts')) {
+        if (filePath.endsWith('.ts') || !filePath.endsWith('.test.ts')) {
             const testPath = filePath.replace(/\.ts$/, '.test.ts');
             if (fs.existsSync(testPath)) {

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:166:13
         fs.renameSync(filePath, targetPath);
 
         // Also demote test file if it exists
-        if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts')) {
+        if (true) {
             const testPath = filePath.replace(/\.ts$/, '.test.ts');
             if (fs.existsSync(testPath)) {

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:167:56
 
         // Also demote test file if it exists
         if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts')) {
-            const testPath = filePath.replace(/\.ts$/, '.test.ts');
+            const testPath = filePath.replace(/\.ts$/, "");
             if (fs.existsSync(testPath)) {
                 const testTarget = path.join(quarantineDir, path.basename(testPath));

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:168:17
         // Also demote test file if it exists
         if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts')) {
             const testPath = filePath.replace(/\.ts$/, '.test.ts');
-            if (fs.existsSync(testPath)) {
+            if (true) {
                 const testTarget = path.join(quarantineDir, path.basename(testPath));
                 fs.renameSync(testPath, testTarget);

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:168:42
         // Also demote test file if it exists
         if (filePath.endsWith('.ts') && !filePath.endsWith('.test.ts')) {
             const testPath = filePath.replace(/\.ts$/, '.test.ts');
-            if (fs.existsSync(testPath)) {
-                const testTarget = path.join(quarantineDir, path.basename(testPath));
-                fs.renameSync(testPath, testTarget);
-            }
+            if (fs.existsSync(testPath)) {}
         }
 

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:176:19
 
         const logEntry = {
             ts: new Date().toISOString(),
-            type: 'DEMOTION',
+            type: "",
             mark: 'RED_REGNANT_DEMOTION',
             file: relativePath,

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:181:19
             file: relativePath,
             reason: reason,
             target: path.relative(ROOT_DIR, targetPath),
-            hive: 'HFO_GEN88',
+            hive: "",
             gen: 88,
             port: 4

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:185:27
             gen: 88,
             port: 4
         };
-        fs.appendFileSync(blackboardPath || BLACKBOARD_PATH, JSON.stringify(logEntry) + '\n');
+        fs.appendFileSync(false, JSON.stringify(logEntry) + '\n');
     } catch (err) {
         console.error(`   > Failed to demote: ${err}`);

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:185:27
             gen: 88,
             port: 4
         };
-        fs.appendFileSync(blackboardPath || BLACKBOARD_PATH, JSON.stringify(logEntry) + '\n');
+        fs.appendFileSync(true, JSON.stringify(logEntry) + '\n');
     } catch (err) {
         console.error(`   > Failed to demote: ${err}`);

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:186:19
             port: 4
         };
         fs.appendFileSync(blackboardPath || BLACKBOARD_PATH, JSON.stringify(logEntry) + '\n');
-    } catch (err) {
-        console.error(`   > Failed to demote: ${err}`);
-    }
+    } catch (err) {}
 }
 

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:191:81
     }
 }
 
-export function checkRootPollution(entries?: string[], blackboardPath?: string) {
-    const targetEntries = entries || fs.readdirSync(ROOT_DIR);
-    for (const entry of targetEntries) {
-        const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
-        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
-        if (!isAllowedFile && !isAllowedPattern) {
-            scream({
-                file: entry,
-                type: 'POLLUTION',
-                message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
-            }, blackboardPath);
-        }
-    }
-}
+export function checkRootPollution(entries?: string[], blackboardPath?: string) {}
 
 export function checkMutationProof(reportPath: string = MUTATION_REPORT_PATH, blackboardPath?: string) {
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should detect disallowed files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:192:27
 }
 
 export function checkRootPollution(entries?: string[], blackboardPath?: string) {
-    const targetEntries = entries || fs.readdirSync(ROOT_DIR);
+    const targetEntries = true;
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should detect disallowed files
statusReason: targetEntries is not iterable

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:193:40
 
 export function checkRootPollution(entries?: string[], blackboardPath?: string) {
     const targetEntries = entries || fs.readdirSync(ROOT_DIR);
-    for (const entry of targetEntries) {
-        const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
-        const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
-        if (!isAllowedFile && !isAllowedPattern) {
-            scream({
-                file: entry,
-                type: 'POLLUTION',
-                message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
-            }, blackboardPath);
-        }
-    }
+    for (const entry of targetEntries) {}
 }
 
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should detect disallowed files
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:196:50
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
         const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
-        if (!isAllowedFile && !isAllowedPattern) {
-            scream({
-                file: entry,
-                type: 'POLLUTION',
-                message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
-            }, blackboardPath);
-        }
+        if (!isAllowedFile && !isAllowedPattern) {}
     }
 }
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should detect disallowed files
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:196:31
     for (const entry of targetEntries) {
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
         const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
-        if (!isAllowedFile && !isAllowedPattern) {
+        if (!isAllowedFile && isAllowedPattern) {
             scream({
                 file: entry,
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should detect disallowed files
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:197:20
         const isAllowedFile = ALLOWED_ROOT_FILES.includes(entry);
         const isAllowedPattern = ALLOWED_ROOT_PATTERNS.some(pattern => pattern.test(entry));
         if (!isAllowedFile && !isAllowedPattern) {
-            scream({
-                file: entry,
-                type: 'POLLUTION',
-                message: `Root pollution detected: ${entry} is not allowed in the cleanroom root.`
-            }, blackboardPath);
+            scream({}, blackboardPath);
         }
     }
killedBy: Physic Scream (Port 4 Gatekeeper) checkRootPollution should detect disallowed files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:207:9
 }
 
 export function checkMutationProof(reportPath: string = MUTATION_REPORT_PATH, blackboardPath?: string) {
-    if (!fs.existsSync(reportPath)) {
+    if (true) {
         console.warn(` WARNING: Mutation report missing at ${reportPath}. Skipping mutation check.`);
         return;
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:208:22
 
 export function checkMutationProof(reportPath: string = MUTATION_REPORT_PATH, blackboardPath?: string) {
     if (!fs.existsSync(reportPath)) {
-        console.warn(` WARNING: Mutation report missing at ${reportPath}. Skipping mutation check.`);
+        console.warn(``);
         return;
     }

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:214:23
 
     try {
         const report = JSON.parse(fs.readFileSync(reportPath, 'utf8'));
-        const files = report.files || {};
+        const files = true;
 
         for (const [filePath, data] of Object.entries(files)) {
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:216:63
         const report = JSON.parse(fs.readFileSync(reportPath, 'utf8'));
         const files = report.files || {};
 
-        for (const [filePath, data] of Object.entries(files)) {
-            const fullFilePath = path.resolve(ROOT_DIR, filePath);
-            if (!fs.existsSync(fullFilePath)) continue; // Skip phantom files from stale reports
-
-            const mutants = (data as any).mutants || [];
-            const total = mutants.length;
-            if (total === 0) continue;
-
-            const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
-            const score = (killed / total) * 100;
-
-            if (score < 80) {
-                scream({
-                    file: filePath,
-                    type: 'MUTATION_FAILURE',
-                    message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
-                }, blackboardPath);
-            } else if (score >= 100) {
-                scream({
-                    file: filePath,
-                    type: 'THEATER',
-                    message: `Mutation score 100% detected. This is "Theater" and is forbidden.`
-                }, blackboardPath);
-            }
-        }
+        for (const [filePath, data] of Object.entries(files)) {}
     } catch (err) {
         console.error(' Failed to parse mutation report:', err);
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:218:17
 
         for (const [filePath, data] of Object.entries(files)) {
             const fullFilePath = path.resolve(ROOT_DIR, filePath);
-            if (!fs.existsSync(fullFilePath)) continue; // Skip phantom files from stale reports
+            if (fs.existsSync(fullFilePath)) continue; // Skip phantom files from stale reports
 
             const mutants = (data as any).mutants || [];
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:218:17
 
         for (const [filePath, data] of Object.entries(files)) {
             const fullFilePath = path.resolve(ROOT_DIR, filePath);
-            if (!fs.existsSync(fullFilePath)) continue; // Skip phantom files from stale reports
+            if (true) continue; // Skip phantom files from stale reports
 
             const mutants = (data as any).mutants || [];
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:220:29
             const fullFilePath = path.resolve(ROOT_DIR, filePath);
             if (!fs.existsSync(fullFilePath)) continue; // Skip phantom files from stale reports
 
-            const mutants = (data as any).mutants || [];
+            const mutants = (data as any).mutants && [];
             const total = mutants.length;
             if (total === 0) continue;
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:220:29
             const fullFilePath = path.resolve(ROOT_DIR, filePath);
             if (!fs.existsSync(fullFilePath)) continue; // Skip phantom files from stale reports
 
-            const mutants = (data as any).mutants || [];
+            const mutants = true;
             const total = mutants.length;
             if (total === 0) continue;
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality
