[Killed] MethodExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:224:28
             const total = mutants.length;
             if (total === 0) continue;
 
-            const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
+            const killed = mutants.length;
             const score = (killed / total) * 100;
 
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:227:17
             const killed = mutants.filter((m: any) => m.status === 'Killed' || m.status === 'Timeout').length;
             const score = (killed / total) * 100;
 
-            if (score < 80) {
+            if (false) {
                 scream({
                     file: filePath,
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for low score
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:233:38
                     type: 'MUTATION_FAILURE',
                     message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
                 }, blackboardPath);
-            } else if (score >= 100) {
-                scream({
-                    file: filePath,
-                    type: 'THEATER',
-                    message: `Mutation score 100% detected. This is "Theater" and is forbidden.`
-                }, blackboardPath);
-            }
+            } else if (score >= 100) {}
         }
     } catch (err) {
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for theater (100%)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:233:24
                     type: 'MUTATION_FAILURE',
                     message: `Mutation score ${score.toFixed(2)}% is below the 80% threshold.`
                 }, blackboardPath);
-            } else if (score >= 100) {
+            } else if (score > 100) {
                 scream({
                     file: filePath,
killedBy: Physic Scream (Port 4 Gatekeeper) checkMutationProof should fail for theater (100%)
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:241:19
                 }, blackboardPath);
             }
         }
-    } catch (err) {
-        console.error(' Failed to parse mutation report:', err);
-    }
+    } catch (err) {}
 }
 

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:242:23
             }
         }
     } catch (err) {
-        console.error(' Failed to parse mutation report:', err);
+        console.error("", err);
     }
 }

[Killed] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:248:24
 
 export function auditContent(filePath: string, content: string, blackboardPath?: string) {
     const relativePath = path.relative(ROOT_DIR, filePath);
-    const isScreamer = filePath.includes('physic_scream') || filePath.includes('red_regnant_mutation_scream');
+    const isScreamer = filePath.includes('physic_scream') && filePath.includes('red_regnant_mutation_scream');
 
     // Amnesia: Debug logs in Silver/Gold
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should ignore debug logs in screamer itself
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:248:24
 
 export function auditContent(filePath: string, content: string, blackboardPath?: string) {
     const relativePath = path.relative(ROOT_DIR, filePath);
-    const isScreamer = filePath.includes('physic_scream') || filePath.includes('red_regnant_mutation_scream');
+    const isScreamer = true;
 
     // Amnesia: Debug logs in Silver/Gold
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should detect debug logs
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:251:9
     const isScreamer = filePath.includes('physic_scream') || filePath.includes('red_regnant_mutation_scream');
 
     // Amnesia: Debug logs in Silver/Gold
-    if (!isScreamer && (content.includes('console.log(') || content.includes('console.debug('))) {
+    if (!isScreamer || content.includes('console.log(') || content.includes('console.debug(')) {
         if (!content.includes('// @permitted')) {
             scream({
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should ignore debug logs in screamer itself
statusReason: expected [ { …(3) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:251:9
     const isScreamer = filePath.includes('physic_scream') || filePath.includes('red_regnant_mutation_scream');
 
     // Amnesia: Debug logs in Silver/Gold
-    if (!isScreamer && (content.includes('console.log(') || content.includes('console.debug('))) {
+    if (false) {
         if (!content.includes('// @permitted')) {
             scream({
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should detect debug logs
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:252:13
 
     // Amnesia: Debug logs in Silver/Gold
     if (!isScreamer && (content.includes('console.log(') || content.includes('console.debug('))) {
-        if (!content.includes('// @permitted')) {
+        if (true) {
             scream({
                 file: relativePath,
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should allow debug logs with @permitted
statusReason: expected [ { file: 'silver\file.ts', …(2) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:252:13
 
     // Amnesia: Debug logs in Silver/Gold
     if (!isScreamer && (content.includes('console.log(') || content.includes('console.debug('))) {
-        if (!content.includes('// @permitted')) {
+        if (content.includes('// @permitted')) {
             scream({
                 file: relativePath,
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should detect debug logs
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:253:20
     // Amnesia: Debug logs in Silver/Gold
     if (!isScreamer && (content.includes('console.log(') || content.includes('console.debug('))) {
         if (!content.includes('// @permitted')) {
-            scream({
-                file: relativePath,
-                type: 'AMNESIA',
-                message: `Debug logs detected in Silver/Gold artifact. This is "Theater" masquerading as "Truth".`
-            }, blackboardPath);
+            scream({}, blackboardPath);
         }
     }
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should detect debug logs
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:262:38
     }
 
     // Bespoke: 'any' without justification
-    if (content.match(/:\s*any/g) && !content.includes('// @bespoke')) {
+    if (content.match(/:\s*any/g) && content.includes('// @bespoke')) {
         scream({
             file: relativePath,
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should detect bespoke 'any' without justification
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:262:9
     }
 
     // Bespoke: 'any' without justification
-    if (content.match(/:\s*any/g) && !content.includes('// @bespoke')) {
+    if (content.match(/:\s*any/g) || !content.includes('// @bespoke')) {
         scream({
             file: relativePath,
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should allow debug logs with @permitted
statusReason: expected [ { file: 'silver\file.ts', …(2) } ] to have a length of +0 but got 1

[Killed] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:263:16
 
     // Bespoke: 'any' without justification
     if (content.match(/:\s*any/g) && !content.includes('// @bespoke')) {
-        scream({
-            file: relativePath,
-            type: 'BESPOKE',
-            message: `Bespoke 'any' type detected without // @bespoke justification.`
-        }, blackboardPath);
+        scream({}, blackboardPath);
     }
 
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should detect bespoke 'any' without justification
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:266:22
         scream({
             file: relativePath,
             type: 'BESPOKE',
-            message: `Bespoke 'any' type detected without // @bespoke justification.`
+            message: ``
         }, blackboardPath);
     }

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:271:9
     }
 
     // Provenance
-    if (filePath.includes('silver') && !content.includes('Provenance:')) {
+    if (true) {
         scream({
             file: relativePath,
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should allow debug logs with @permitted
statusReason: expected [ { file: 'silver\file.ts', …(2) } ] to have a length of +0 but got 1

[Killed] LogicalOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:271:9
     }
 
     // Provenance
-    if (filePath.includes('silver') && !content.includes('Provenance:')) {
+    if (filePath.includes('silver') || !content.includes('Provenance:')) {
         scream({
             file: relativePath,
killedBy: Physic Scream (Port 4 Gatekeeper) auditContent should allow debug logs with @permitted
statusReason: expected [ { file: 'silver\file.ts', …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:281:24
 }
 
 export function scanMedallions(medallionPaths?: string[], blackboardPath?: string) {
-    const medallions = medallionPaths || [
-        path.join(HOT_DIR, 'silver'),
-        path.join(HOT_DIR, 'gold')
-    ];
+    const medallions = true;
 
     for (const dir of medallions) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: medallions is not iterable

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:281:24
 }
 
 export function scanMedallions(medallionPaths?: string[], blackboardPath?: string) {
-    const medallions = medallionPaths || [
-        path.join(HOT_DIR, 'silver'),
-        path.join(HOT_DIR, 'gold')
-    ];
+    const medallions = false;
 
     for (const dir of medallions) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: medallions is not iterable

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:287:13
     ];
 
     for (const dir of medallions) {
-        if (!fs.existsSync(dir)) continue;
+        if (true) continue;
 
         if (dir === ROOT_DIR || dir.includes('cold_obsidian_sandbox')) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:289:13
     for (const dir of medallions) {
         if (!fs.existsSync(dir)) continue;
 
-        if (dir === ROOT_DIR || dir.includes('cold_obsidian_sandbox')) {
+        if (true) {
             console.warn(`  QUEEN'S WARNING: Refusing to scan Forbidden Zone: ${dir}`);
             continue;
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:289:13
     for (const dir of medallions) {
         if (!fs.existsSync(dir)) continue;
 
-        if (dir === ROOT_DIR || dir.includes('cold_obsidian_sandbox')) {
+        if (dir !== ROOT_DIR || dir.includes('cold_obsidian_sandbox')) {
             console.warn(`  QUEEN'S WARNING: Refusing to scan Forbidden Zone: ${dir}`);
             continue;
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:295:17
         }
 
         const walk = (currentDir: string, depth: number = 0) => {
-            if (depth > RECURSION_LIMIT) return;
+            if (depth <= RECURSION_LIMIT) return;
             const entries = fs.readdirSync(currentDir, { withFileTypes: true });
 
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:295:17
         }
 
         const walk = (currentDir: string, depth: number = 0) => {
-            if (depth > RECURSION_LIMIT) return;
+            if (true) return;
             const entries = fs.readdirSync(currentDir, { withFileTypes: true });
 
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:296:73
 
         const walk = (currentDir: string, depth: number = 0) => {
             if (depth > RECURSION_LIMIT) return;
-            const entries = fs.readdirSync(currentDir, { withFileTypes: true });
+            const entries = fs.readdirSync(currentDir, { withFileTypes: false });
 
             for (const entry of entries) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:298:42
             if (depth > RECURSION_LIMIT) return;
             const entries = fs.readdirSync(currentDir, { withFileTypes: true });
 
-            for (const entry of entries) {
-                const fullPath = path.join(currentDir, entry.name);
-                if (entry.name === '.git' || entry.name === 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
-
-                if (entry.isDirectory()) {
-                    walk(fullPath, depth + 1);
-                    continue;
-                }
-
-                const content = fs.readFileSync(fullPath, 'utf8');
-                auditContent(fullPath, content, blackboardPath);
-
-                if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {
-                    const testPath = fullPath.replace(/\.ts$/, '.test.ts');
-                    if (!fs.existsSync(testPath)) {
-                        scream({
-                            file: path.relative(ROOT_DIR, fullPath),
-                            type: 'THEATER',
-                            message: `Silver/Gold implementation missing corresponding test: ${path.basename(testPath)}`
-                        }, blackboardPath);
-                    }
-                }
-            }
+            for (const entry of entries) {}
         };
         walk(dir);
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:300:79
 
             for (const entry of entries) {
                 const fullPath = path.join(currentDir, entry.name);
-                if (entry.name === '.git' || entry.name === 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
+                if (entry.name === '.git' || entry.name === 'node_modules' || entry.name !== 'quarantine' || entry.name === '.stryker-tmp') continue;
 
                 if (entry.isDirectory()) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:300:46
 
             for (const entry of entries) {
                 const fullPath = path.join(currentDir, entry.name);
-                if (entry.name === '.git' || entry.name === 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
+                if (entry.name === '.git' || entry.name !== 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
 
                 if (entry.isDirectory()) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:302:21
                 const fullPath = path.join(currentDir, entry.name);
                 if (entry.name === '.git' || entry.name === 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
 
-                if (entry.isDirectory()) {
+                if (true) {
                     walk(fullPath, depth + 1);
                     continue;
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: ENOTDIR: not a directory, scandir 'C:\Dev\active\hfo_gen88\.stryker-tmp\sandbox-W0l7DD\hot_obsidian_sandbox\silver\P4_RED_REGNANT\mock_silver\impl.ts'

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:302:42
                 const fullPath = path.join(currentDir, entry.name);
                 if (entry.name === '.git' || entry.name === 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
 
-                if (entry.isDirectory()) {
-                    walk(fullPath, depth + 1);
-                    continue;
-                }
+                if (entry.isDirectory()) {}
 
                 const content = fs.readFileSync(fullPath, 'utf8');

[NoCoverage] ArithmeticOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:303:36
                 if (entry.name === '.git' || entry.name === 'node_modules' || entry.name === 'quarantine' || entry.name === '.stryker-tmp') continue;
 
                 if (entry.isDirectory()) {
-                    walk(fullPath, depth + 1);
+                    walk(fullPath, depth - 1);
                     continue;
                 }

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:310:118
                 const content = fs.readFileSync(fullPath, 'utf8');
                 auditContent(fullPath, content, blackboardPath);
 
-                if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {
-                    const testPath = fullPath.replace(/\.ts$/, '.test.ts');
-                    if (!fs.existsSync(testPath)) {
-                        scream({
-                            file: path.relative(ROOT_DIR, fullPath),
-                            type: 'THEATER',
-                            message: `Silver/Gold implementation missing corresponding test: ${path.basename(testPath)}`
-                        }, blackboardPath);
-                    }
-                }
+                if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {}
             }
         };
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:310:21
                 const content = fs.readFileSync(fullPath, 'utf8');
                 auditContent(fullPath, content, blackboardPath);
 
-                if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {
+                if (false) {
                     const testPath = fullPath.replace(/\.ts$/, '.test.ts');
                     if (!fs.existsSync(testPath)) {
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Survived] Regex
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:311:55
                 auditContent(fullPath, content, blackboardPath);
 
                 if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {
-                    const testPath = fullPath.replace(/\.ts$/, '.test.ts');
+                    const testPath = fullPath.replace(/\.ts/, '.test.ts');
                     if (!fs.existsSync(testPath)) {
                         scream({

[Killed] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:312:25
 
                 if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {
                     const testPath = fullPath.replace(/\.ts$/, '.test.ts');
-                    if (!fs.existsSync(testPath)) {
+                    if (false) {
                         scream({
                             file: path.relative(ROOT_DIR, fullPath),
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:312:51
 
                 if (entry.name.endsWith('.ts') && !entry.name.endsWith('.test.ts') && !entry.name.endsWith('.d.ts')) {
                     const testPath = fullPath.replace(/\.ts$/, '.test.ts');
-                    if (!fs.existsSync(testPath)) {
-                        scream({
-                            file: path.relative(ROOT_DIR, fullPath),
-                            type: 'THEATER',
-                            message: `Silver/Gold implementation missing corresponding test: ${path.basename(testPath)}`
-                        }, blackboardPath);
-                    }
+                    if (!fs.existsSync(testPath)) {}
                 }
             }
killedBy: Physic Scream (Port 4 Gatekeeper) scanMedallions should detect missing tests for implementation files
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:326:40
     }
 }
 
-export function checkLedgerIntegrity() {
-    // Basic structural check for JSONL
-    if (fs.existsSync(BLACKBOARD_PATH)) {
-        const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
-        for (const line of lines) {
-            try {
-                JSON.parse(line);
-            } catch (e) {
-                scream({
-                    file: 'obsidianblackboard.jsonl',
-                    type: 'VIOLATION',
-                    message: `Blackboard corruption: Invalid JSON line.`
-                });
-            }
-        }
-    }
-}
+export function checkLedgerIntegrity() {}
 
 export function checkManifestIntegrity() {

[Survived] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:328:41
 
 export function checkLedgerIntegrity() {
     // Basic structural check for JSONL
-    if (fs.existsSync(BLACKBOARD_PATH)) {
-        const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
-        for (const line of lines) {
-            try {
-                JSON.parse(line);
-            } catch (e) {
-                scream({
-                    file: 'obsidianblackboard.jsonl',
-                    type: 'VIOLATION',
-                    message: `Blackboard corruption: Invalid JSON line.`
-                });
-            }
-        }
-    }
+    if (fs.existsSync(BLACKBOARD_PATH)) {}
 }
 

[Survived] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:328:9
 
 export function checkLedgerIntegrity() {
     // Basic structural check for JSONL
-    if (fs.existsSync(BLACKBOARD_PATH)) {
+    if (true) {
         const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
         for (const line of lines) {

[Survived] MethodExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:329:23
 export function checkLedgerIntegrity() {
     // Basic structural check for JSONL
     if (fs.existsSync(BLACKBOARD_PATH)) {
-        const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
+        const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n');
         for (const line of lines) {
             try {

[Survived] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:329:70
 export function checkLedgerIntegrity() {
     // Basic structural check for JSONL
     if (fs.existsSync(BLACKBOARD_PATH)) {
-        const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
+        const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split("").filter(Boolean);
         for (const line of lines) {
             try {

[Survived] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:330:35
     // Basic structural check for JSONL
     if (fs.existsSync(BLACKBOARD_PATH)) {
         const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
-        for (const line of lines) {
-            try {
-                JSON.parse(line);
-            } catch (e) {
-                scream({
-                    file: 'obsidianblackboard.jsonl',
-                    type: 'VIOLATION',
-                    message: `Blackboard corruption: Invalid JSON line.`
-                });
-            }
-        }
+        for (const line of lines) {}
     }
 }

[Survived] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:331:17
     if (fs.existsSync(BLACKBOARD_PATH)) {
         const lines = fs.readFileSync(BLACKBOARD_PATH, 'utf8').split('\n').filter(Boolean);
         for (const line of lines) {
-            try {
-                JSON.parse(line);
-            } catch (e) {
+            try {} catch (e) {
                 scream({
                     file: 'obsidianblackboard.jsonl',

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:333:25
         for (const line of lines) {
             try {
                 JSON.parse(line);
-            } catch (e) {
-                scream({
-                    file: 'obsidianblackboard.jsonl',
-                    type: 'VIOLATION',
-                    message: `Blackboard corruption: Invalid JSON line.`
-                });
-            }
+            } catch (e) {}
         }
     }

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:337:30
                 scream({
                     file: 'obsidianblackboard.jsonl',
                     type: 'VIOLATION',
-                    message: `Blackboard corruption: Invalid JSON line.`
+                    message: ``
                 });
             }

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:344:42
     }
 }
 
-export function checkManifestIntegrity() {
-    const manifestPath = path.join(HOT_DIR, 'gold/manifest.yaml');
-    if (fs.existsSync(manifestPath)) {
-        try {
-            const manifest = yaml.load(fs.readFileSync(manifestPath, 'utf8'));
-            ManifestSchema.parse(manifest);
-        } catch (e) {
-            scream({
-                file: 'manifest.yaml',
-                type: 'VIOLATION',
-                message: `Manifest schema violation: ${e}`
-            });
-        }
-    }
-}
+export function checkManifestIntegrity() {}
 
 export async function main() {

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:345:45
 }
 
 export function checkManifestIntegrity() {
-    const manifestPath = path.join(HOT_DIR, 'gold/manifest.yaml');
+    const manifestPath = path.join(HOT_DIR, "");
     if (fs.existsSync(manifestPath)) {
         try {

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:346:9
 
 export function checkManifestIntegrity() {
     const manifestPath = path.join(HOT_DIR, 'gold/manifest.yaml');
-    if (fs.existsSync(manifestPath)) {
+    if (false) {
         try {
             const manifest = yaml.load(fs.readFileSync(manifestPath, 'utf8'));
