[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:346:38
 
 export function checkManifestIntegrity() {
     const manifestPath = path.join(HOT_DIR, 'gold/manifest.yaml');
-    if (fs.existsSync(manifestPath)) {
-        try {
-            const manifest = yaml.load(fs.readFileSync(manifestPath, 'utf8'));
-            ManifestSchema.parse(manifest);
-        } catch (e) {
-            scream({
-                file: 'manifest.yaml',
-                type: 'VIOLATION',
-                message: `Manifest schema violation: ${e}`
-            });
-        }
-    }
+    if (fs.existsSync(manifestPath)) {}
 }
 

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:347:13
 export function checkManifestIntegrity() {
     const manifestPath = path.join(HOT_DIR, 'gold/manifest.yaml');
     if (fs.existsSync(manifestPath)) {
-        try {
-            const manifest = yaml.load(fs.readFileSync(manifestPath, 'utf8'));
-            ManifestSchema.parse(manifest);
-        } catch (e) {
+        try {} catch (e) {
             scream({
                 file: 'manifest.yaml',

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:350:21
         try {
             const manifest = yaml.load(fs.readFileSync(manifestPath, 'utf8'));
             ManifestSchema.parse(manifest);
-        } catch (e) {
-            scream({
-                file: 'manifest.yaml',
-                type: 'VIOLATION',
-                message: `Manifest schema violation: ${e}`
-            });
-        }
+        } catch (e) {}
     }
 }

[NoCoverage] ObjectLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:351:20
             const manifest = yaml.load(fs.readFileSync(manifestPath, 'utf8'));
             ManifestSchema.parse(manifest);
         } catch (e) {
-            scream({
-                file: 'manifest.yaml',
-                type: 'VIOLATION',
-                message: `Manifest schema violation: ${e}`
-            });
+            scream({});
         }
     }

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:354:26
             scream({
                 file: 'manifest.yaml',
                 type: 'VIOLATION',
-                message: `Manifest schema violation: ${e}`
+                message: ``
             });
         }

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:370:9
     checkLedgerIntegrity();
     checkManifestIntegrity();
 
-    if (violations.length > 0) {
+    if (true) {
         console.error(`\n ❌ ${violations.length} VIOLATIONS DETECTED. PREPARING PURGE.`);
         

[NoCoverage] EqualityOperator
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:374:78
         console.error(`\n ❌ ${violations.length} VIOLATIONS DETECTED. PREPARING PURGE.`);
         
         // Final purge: Demote everything with ANY violation
-        const filesToPurge = new Set(violations.map(v => v.file).filter(f => f !== 'SYSTEM'));
+        const filesToPurge = new Set(violations.map(v => v.file).filter(f => f === 'SYSTEM'));
         for (const relPath of filesToPurge) {
             const fullPath = path.resolve(ROOT_DIR, relPath);

[NoCoverage] ArrowFunction
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:374:73
         console.error(`\n ❌ ${violations.length} VIOLATIONS DETECTED. PREPARING PURGE.`);
         
         // Final purge: Demote everything with ANY violation
-        const filesToPurge = new Set(violations.map(v => v.file).filter(f => f !== 'SYSTEM'));
+        const filesToPurge = new Set(violations.map(v => v.file).filter(() => undefined));
         for (const relPath of filesToPurge) {
             const fullPath = path.resolve(ROOT_DIR, relPath);

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:375:45
         
         // Final purge: Demote everything with ANY violation
         const filesToPurge = new Set(violations.map(v => v.file).filter(f => f !== 'SYSTEM'));
-        for (const relPath of filesToPurge) {
-            const fullPath = path.resolve(ROOT_DIR, relPath);
-            if (fs.existsSync(fullPath)) {
-                demote(fullPath, 'Failed Mutation/Cleanroom Audit');
-            }
-        }
+        for (const relPath of filesToPurge) {}
         
         console.error('\n 💀 CLEANROOM PURGE COMPLETE. FAIL-CLOSED.');

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:377:17
         const filesToPurge = new Set(violations.map(v => v.file).filter(f => f !== 'SYSTEM'));
         for (const relPath of filesToPurge) {
             const fullPath = path.resolve(ROOT_DIR, relPath);
-            if (fs.existsSync(fullPath)) {
+            if (true) {
                 demote(fullPath, 'Failed Mutation/Cleanroom Audit');
             }

[NoCoverage] ConditionalExpression
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:377:17
         const filesToPurge = new Set(violations.map(v => v.file).filter(f => f !== 'SYSTEM'));
         for (const relPath of filesToPurge) {
             const fullPath = path.resolve(ROOT_DIR, relPath);
-            if (fs.existsSync(fullPath)) {
+            if (false) {
                 demote(fullPath, 'Failed Mutation/Cleanroom Audit');
             }

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:378:34
         for (const relPath of filesToPurge) {
             const fullPath = path.resolve(ROOT_DIR, relPath);
             if (fs.existsSync(fullPath)) {
-                demote(fullPath, 'Failed Mutation/Cleanroom Audit');
+                demote(fullPath, "");
             }
         }

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:384:12
         
         console.error('\n 💀 CLEANROOM PURGE COMPLETE. FAIL-CLOSED.');
         process.exit(1);
-    } else {
-        console.log('\n ✅ CLEANROOM STABLE. THE QUEEN IS PLEASED.');
-        process.exit(0);
-    }
+    } else {}
 }
 

[NoCoverage] StringLiteral
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:385:21
         console.error('\n 💀 CLEANROOM PURGE COMPLETE. FAIL-CLOSED.');
         process.exit(1);
     } else {
-        console.log('\n ✅ CLEANROOM STABLE. THE QUEEN IS PLEASED.');
+        console.log("");
         process.exit(0);
     }

[NoCoverage] BlockStatement
hot_obsidian_sandbox/silver/P4_RED_REGNANT/physic_scream.ts:390:57
     }
 }
 
-if (process.argv[1] === fileURLToPath(import.meta.url)) {
-    main().catch(console.error);
-}
+if (process.argv[1] === fileURLToPath(import.meta.url)) {}
 
