[Killed] StringLiteral
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:41:3
 
 export const VerbSchema = z.enum([
   'OBSERVE',    // P0: Lidless Legion
-  'BRIDGE',     // P1: Web Weaver
+  "",     // P1: Web Weaver
   'SHAPE',      // P2: Mirror Magus
   'INJECT',     // P3: Spore Storm
killedBy: Commander P1: Web Weaver (Property Tests) Stigmergy: Event Validation Invariants Property: All HFO commander verbs are valid as Stigmergy event types; P1 Web Weaver - Interlock Verification should validate a stigmergy event; Commander P1: Web Weaver (WebWeaver) Behavior: Stigmergy Event Logging Scenario: Validating a Stigmergy event for the Blackboard
statusReason: Property failed after 5 tests
{ seed: 1014253170, path: "4:0:0:0:0:0:0:1:1:1", endOnFailure: true }
Counterexample: [{"id":"00000000-0000-1000-8000-000000000000","timestamp":0,"sourcePort":0,"eventType":"BRIDGE","payload":0,"correlationId":undefined}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:47:3
   'DISRUPT',    // P4: Red Regnant
   'IMMUNIZE',   // P5: Pyre Praetorian
   'ASSIMILATE', // P6: Kraken Keeper
-  'NAVIGATE',   // P7: Spider Sovereign
+  "",   // P7: Spider Sovereign
 ]);
 
killedBy: Commander P1: Web Weaver (Property Tests) Stigmergy: Event Validation Invariants Property: All HFO commander verbs are valid as Stigmergy event types
statusReason: Property failed after 6 tests
{ seed: -1698655496, path: "5:0:0:0:0:0:0:1:1", endOnFailure: true }
Counterexample: [{"id":"00000000-0000-1000-8000-000000000000","timestamp":0,"sourcePort":0,"eventType":"NAVIGATE","payload":false,"correlationId":undefined}]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] MethodExpression
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:57:15
 export const HfoEnvelopeSchema = z.object({
   id: z.string().uuid(),
   timestamp: z.number(),
-  sourcePort: z.number().min(0).max(7),
+  sourcePort: z.number().min(0).min(7),
   targetPort: z.number().min(0).max(7),
   verb: VerbSchema,
killedBy: Commander P1: Web Weaver (WebWeaver) Behavior: Message Wrapping & HfoEnvelope Scenario: Validating an HfoEnvelope border crossing
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:57:15
 export const HfoEnvelopeSchema = z.object({
   id: z.string().uuid(),
   timestamp: z.number(),
-  sourcePort: z.number().min(0).max(7),
+  sourcePort: z.number().max(0).max(7),
   targetPort: z.number().min(0).max(7),
   verb: VerbSchema,
killedBy: P1 CONTRACT HARDENING - Mutant Kills should kill Mutation: min(0) to max(0) or similar for ports
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:58:15
   id: z.string().uuid(),
   timestamp: z.number(),
   sourcePort: z.number().min(0).max(7),
-  targetPort: z.number().min(0).max(7),
+  targetPort: z.number().min(0).min(7),
   verb: VerbSchema,
   payload: z.unknown(),
killedBy: P1 CONTRACT HARDENING - Mutant Kills should kill Mutation: min(0) to max(0) or similar for ports
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:58:15
   id: z.string().uuid(),
   timestamp: z.number(),
   sourcePort: z.number().min(0).max(7),
-  targetPort: z.number().min(0).max(7),
+  targetPort: z.number().max(0).max(7),
   verb: VerbSchema,
   payload: z.unknown(),
killedBy: Commander P1: Web Weaver (WebWeaver) Behavior: Message Wrapping & HfoEnvelope Scenario: Validating an HfoEnvelope border crossing
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:89:134
  * Bridges a message by validating it against a schema
  * Polymorphic adapter pattern for protocol bridging
  */
-export function bridge<T>(message: unknown, schema: z.ZodType<T>): { success: true; data: T } | { success: false; errors: string[] } {
-  const result = schema.safeParse(message);
-  if (result.success) {
-    return { success: true, data: result.data };
-  }
-  return {
-    success: false,
-    errors: result.error.errors.map(e => `${e.path.join('.')}: ${e.message}`),
-  };
-}
+export function bridge<T>(message: unknown, schema: z.ZodType<T>): { success: true; data: T } | { success: false; errors: string[] } {}
 
 // --- FUSE FUNCTION ---
killedBy: Commander P1: Web Weaver (WebWeaver) Verb: BRIDGE (Protocol Adaptation) Scenario: Validating a well-formed payload against a contract; Commander P1: Web Weaver (WebWeaver) Verb: BRIDGE (Protocol Adaptation) Scenario: Validating a malformed payload against a contract; Commander P1: Web Weaver (WebWeaver) Behavior: Message Wrapping & HfoEnvelope Scenario: Validating an HfoEnvelope border crossing
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ConditionalExpression
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:91:7
  */
 export function bridge<T>(message: unknown, schema: z.ZodType<T>): { success: true; data: T } | { success: false; errors: string[] } {
   const result = schema.safeParse(message);
-  if (result.success) {
+  if (true) {
     return { success: true, data: result.data };
   }
killedBy: Commander P1: Web Weaver (Property Tests) Verb: BRIDGE (Protocol adaptation invariants) Property: Messages that violate the contract must be rejected; Commander P1: Web Weaver (WebWeaver) Verb: BRIDGE (Protocol Adaptation) Scenario: Validating a malformed payload against a contract; P1 CONTRACT HARDENING - Mutant Kills should kill Mutation: Error path join(".") in bridge function
statusReason: Property failed after 1 tests
{ seed: 1500679350, path: "0:0:0", endOnFailure: true }
Counterexample: [{"name":0,"value":""}]
Shrunk 2 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:91:23
  */
 export function bridge<T>(message: unknown, schema: z.ZodType<T>): { success: true; data: T } | { success: false; errors: string[] } {
   const result = schema.safeParse(message);
-  if (result.success) {
-    return { success: true, data: result.data };
-  }
+  if (result.success) {}
   return {
     success: false,
killedBy: Commander P1: Web Weaver (Property Tests) Verb: BRIDGE (Protocol adaptation invariants) Property: Every valid message must successfully cross the bridge; Commander P1: Web Weaver (WebWeaver) Verb: BRIDGE (Protocol Adaptation) Scenario: Validating a well-formed payload against a contract; Commander P1: Web Weaver (WebWeaver) Behavior: Message Wrapping & HfoEnvelope Scenario: Validating an HfoEnvelope border crossing
statusReason: Property failed after 1 tests
{ seed: 77798396, path: "0:0:0:0", endOnFailure: true }
Counterexample: [{"name":" ","value":0}]
Shrunk 3 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrowFunction
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:96:37
   }
   return {
     success: false,
-    errors: result.error.errors.map(e => `${e.path.join('.')}: ${e.message}`),
+    errors: result.error.errors.map(() => undefined),
   };
 }
killedBy: Commander P1: Web Weaver (WebWeaver) Verb: BRIDGE (Protocol Adaptation) Scenario: Validating a malformed payload against a contract; P1 CONTRACT HARDENING - Mutant Kills should kill Mutation: Error path join(".") in bridge function
statusReason: expected [ undefined ] to include 'age: Expected number, received string'

[Killed] BlockStatement
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:109:23
 export function fuse<A extends z.ZodRawShape, B extends z.ZodRawShape>(
   schemaA: z.ZodObject<A>,
   schemaB: z.ZodObject<B>
-): z.ZodObject<A & B> {
-  return schemaA.merge(schemaB) as z.ZodObject<A & B>;
-}
+): z.ZodObject<A & B> {}
 
 // --- WRAP ENVELOPE ---
killedBy: P1 Web Weaver - Interlock Verification should fuse schemas and bridge data; Commander P1: Web Weaver (WebWeaver) Verb: FUSE (Schema Composition) Scenario: Merging two distinct identity contracts; Commander P1: Web Weaver (WebWeaver) Verb: FUSE (Schema Composition) Scenario: Fused schema rejects partial matches
statusReason: Cannot read properties of undefined (reading 'safeParse')

[Killed] BlockStatement
hfo_ports/P1_WEB_WEAVER/contracts/index.ts:124:16
   verb: Verb,
   payload: unknown,
   priority: 'low' | 'normal' | 'high' | 'critical' = 'normal'
-): HfoEnvelope {
-  return {
-    id: crypto.randomUUID(),
-    timestamp: Date.now(),
-    sourcePort,
-    targetPort,
-    verb,
-    payload,
-    metadata: {
-      ttl: 60000,
-      priority,
-    },
-  };
-}
+): HfoEnvelope {}
 
killedBy: Commander P1: Web Weaver (WebWeaver) Behavior: Message Wrapping & HfoEnvelope Scenario: Wrapping a payload with metadata
statusReason: Cannot read properties of undefined (reading 'sourcePort')
